{
  "resources": [
    {
      "id": 31,
      "title": "Reference 3 doi.org",
      "description": "The Mitigating Role of Family Resilience and Connection to Promote Positive Socioemotional and School-Related Outcomes. Child and Adolescent Psychiatric Clinics of North America, 31(1), 45–70. https:/...",
      "category": "California Guidelines",
      "source": "RRC_Ref_3_doi.org",
      "url": null,
      "chunkCount": 5,
      "fullContent": "The Mitigating Role of Family Resilience and Connection to Promote Positive Socioemotional and School-Related Outcomes. Child and Adolescent Psychiatric Clinics of North America, 31(1), 45–70. https://doi.org/10.1016/j.chc.2021.08.001. 25. Guo, S., O'Connor, M., Mensah, F., Olsson, C. A., Goldfeld, S., Lacey, R. E., Slopen, N., Thurber, K. A., & Priest, N. (2022). Measuring Positive Childhood Experiences: Testing the Structural and Predictive Validity of the Health Outcomes From Positive Experiences (HOPE) Framework. Academic Pediatrics, 22(6), 942–951. https://doi.org/10.1016/j.acap.2021.11.003.  26. Wang, Y., Raffeld, M. R., Slopen, N., Hale, L., & Dunn, E. C. (2016). Childhood adversity and insomnia in adolescence. Sleep Medicine, 21, 12–18. https://doi.org/10.1016/j.sleep.2016.01.011. 27. Robles, A., Gjelsvik, A., Hirway, P., Vivier, P. M., & High, P. (2019). Adverse Childhood Experiences and Protective Factors With School Engagement. Pediatrics, 144(2), e20182945. https://doi.org/\n\n27. Robles, A., Gjelsvik, A., Hirway, P., Vivier, P. M., & High, P. (2019). Adverse Childhood Experiences and Protective Factors With School Engagement. Pediatrics, 144(2), e20182945. https://doi.org/10.1542/peds.2018-2945. 28. Bellis, M. A., Hughes, K., Ford, K., Harcastle, K. A., Sharp, C. A., Wood, S., Homolova, L., & Davies, A. (2018). Adverse childhood experiences and sources of childhood resilience: a retrospective study of their combined relationships with child health and educational attendance. BMC Public Health, 18(792). https://doi.org/10.1186/s12889-018-5699-8. 29. Stempel, H., Cox-Martin, M., Bronsert, M., Dickinson, L. M., & Allison, M. A. (2017). Chronic School Absenteeism and the Role of Adverse Childhood Experiences. Academic Pediatrics, 17(8), 837–843. https://doi.org/10.1016/j.acap.2017.09.013. 30. Giovanelli, A., Reynolds, A. J., Mondi, C. F., & Ou, S. R. (2016). Adverse Childhood Experiences and Adult Well-Being in a Low-income, Urban Cohort. Pediatrics, 137(4), e2\n\n1016/j.acap.2017.09.013. 30. Giovanelli, A., Reynolds, A. J., Mondi, C. F., & Ou, S. R. (2016). Adverse Childhood Experiences and Adult Well-Being in a Low-income, Urban Cohort. Pediatrics, 137(4), e20154016. https://doi.org/10.1542/peds.2015-4016. 31. Bright, M. A., Knapp, C., Hinojosa, M. S., Alford, S., & Bonner, B. (2016). The Comorbidity of Physical, Mental, and Developmental Conditions Associated with Childhood Adversity: A Population Based Study. Maternal and Child Health Journal, 20(4), 843–853. https://doi.org/10.1007/s10995-015-1915-7. 32. Cohen, A., Marey-Sarwan, I., & Gross Manos, D. (2024). Youth Perspectives of Neglect Signs and Help-Seeking. Behavioral Sciences (Basel, Switzerland), 14(8), 704. https://doi.org/10.3390/bs14080704. 33. Bethell, C., Jones, J., Gombojav, N., Linkenbach, J., & Sege, R. (2019). Positive Childhood Experiences and Adult Mental and Relational Health in a Statewide Sample: Associations Across Adverse Childhood Experiences Levels. JAMA Pediatrics, \n\nkenbach, J., & Sege, R. (2019). Positive Childhood Experiences and Adult Mental and Relational Health in a Statewide Sample: Associations Across Adverse Childhood Experiences Levels. JAMA Pediatrics, 173(11), e193007. doi: 10.1001/jamapediatrics.2019.3007. 34. Garner, A., Yogman, M., & Committee on Psychosocial Aspects of Child and Family Health, Section on Developmental and Behavioral Pediatrics, Council on Early Childhood (2021). Preventing Childhood Toxic Stress: Partnering With Families and Communities to Promote Relational Health. Pediatrics, 148(2), e2021052582. https://doi.org/10.1542/peds.2021-052582. 35. Sege, R. D., & Harper Browne, C. (2017). Responding to ACEs With HOPE: Health Outcomes From Positive Experiences. Academic pediatrics, 17(7S), S79–S85. https://doi.org/10.1016/j.acap.2017.03.007. 36. National Alliance on Mental Illness California. (2021, July). Mental Health in California: State Fact Sheet. Retrieved on April 10, 2025 from https://namica.org/wp-content/uploads\n\ncap.2017.03.007. 36. National Alliance on Mental Illness California. (2021, July). Mental Health in California: State Fact Sheet. Retrieved on April 10, 2025 from https://namica.org/wp-content/uploads/2021/07/CaliforniaStateFactSheet.pdf. 37. Taylor, R. D., Oberle, E., Durlak, J. A., & Weissberg, R. P. (2017). Promoting Positive Youth Development Through School-Based Social and Emotional Learning Interventions: A Meta-Analysis of Follow-Up Effects. Child development, 88(4), 1156–1171. https://doi.org/10.1111/cdev.12864. 38. Kase, C., Hoover, S., Boyd, G., West, K. D., Dubenitz, J., Trivedi, P. A., Peterson, H. J., & Stein, B. D. (2017). Educational Outcomes Associated With School Behavioral Health Interventions: A",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "aces",
        "toxic stress",
        "resilience",
        "relationship",
        "connection",
        "mental health",
        "behavior",
        "emotion"
      ]
    },
    {
      "id": 6,
      "title": "ccee school climate archive.html.txt",
      "description": "California Collaborative for Educational Excellence - School Climate\nSource: https://www.ccee-ca.org/resources/ccee-resource-archive/school-climate/\n\nHomepage - CCEE\n\n \n\nA Quality, \nEquitable Educatio...",
      "category": "California Guidelines",
      "source": "ccee_school_climate_archive.html.txt",
      "url": null,
      "chunkCount": 6,
      "fullContent": "California Collaborative for Educational Excellence - School Climate\nSource: https://www.ccee-ca.org/resources/ccee-resource-archive/school-climate/\n\nHomepage - CCEE\n\n \n\nA Quality, \nEquitable Education \nFor Every Student\n\nCalifornia Collaborative for Educational Excellence transforms public education, so every student is inspired and prepared to thrive as their best self in the world through a focus on…\n\nSystem of Support\n\nCommunity Engagement \n\nLearning Acceleration\n\nDirect Technical Assistance\n\nCCEE Initiatives\n\nCalifornia Collaborative for Educational Excellence (CCEE) aligns its initiatives with three purpose drivers to more effectively achieve its core mission \n\nContinuous Improvement\n\nCCEE \nmodels\n and partners with the field to adopt a mindset of curiosity and institute a practice of ongoing improvement. \n\nVIEW INITIATIVES\n\nWHAT WE DO:\n\nCCEE, under its Continuous Improvement driver, is devoted to advancing and refining educational practices to achieve superior outcomes. The orga\n\nf ongoing improvement. \n\nVIEW INITIATIVES\n\nWHAT WE DO:\n\nCCEE, under its Continuous Improvement driver, is devoted to advancing and refining educational practices to achieve superior outcomes. The organization works diligently to enhance professional development and strengthen the capabilities of Local Educational Agencies (LEAs). By participating, you join a collective pursuit of educational excellence, contributing to the ongoing improvement and success of learning environments and methodologies.\n\nVIEW INITIATIVES\n\nStudent Success\n\nCCEE \nstrengthens\n and supports the systems and programs that evidence shows are fostering learning and accountability to ensure student success.\n\nVIEW INITIATIVES\n\nWHAT WE DO:\n\nCCEE, through its Student Success driver, is committed to unlocking every student’s potential by implementing comprehensive initiatives. These initiatives aim to address educational inequities, enhance learning outcomes, and promote inclusivity. CCEE invites superintendents to colla\n\n potential by implementing comprehensive initiatives. These initiatives aim to address educational inequities, enhance learning outcomes, and promote inclusivity. CCEE invites superintendents to collaborate, with the goal of achieving transformative impacts within their districts, ensuring that all students have the opportunity to succeed.\n\nVIEW INITIATIVES\n\nStudent-Centered Approaches\n\nCCEE \nprioritizes\n the well-being of all students, their families, schools, and communities by promoting socially just and inclusive practices. These drivers aim to better reflect CCEE’s commitment to education and its stakeholders.\n\nVIEW INITIATIVES\n\nWHAT WE DO:\n\nCCEE champions a student-first philosophy through its Student-Centered Approaches, leading the way in transformative change. Initiatives such as Open Door, Leadership Institute, and Community Engagement are central to this effort. CCEE extends an invitation to superintendents to collaborate, aiming to raise the standard of education in Califor\n\nOpen Door, Leadership Institute, and Community Engagement are central to this effort. CCEE extends an invitation to superintendents to collaborate, aiming to raise the standard of education in California by fostering inclusivity, compassion, and innovation in learning environments.\n\nVIEW INITIATIVES\n\nConnecting California: A Free Virtual Conference\n\n Join educators, families, community partners, and state agencies for Connecting California, a free virtual conference focused on strengthening connections across the Statewide System of Support (SSOS).  \n \nLearn More and Register\n\nLEARNING & DEVELOPMENT\n\nFeatured Resources \n\nWe’re helping educators and administrators achieve goals identified in Local Control and Accountability Plans.\n\nLEA Leadership and Staff\n\n California Attendance Guide: Taking a Comprehensive Approach to Attendance and Engagement in California\n\nLEA Leadership and Staff\n\n Frontline Voices\n\nLEA Leadership and Staff\n\n Assessment System Review Online Learning Path (2.0 Vers\n\ning a Comprehensive Approach to Attendance and Engagement in California\n\nLEA Leadership and Staff\n\n Frontline Voices\n\nLEA Leadership and Staff\n\n Assessment System Review Online Learning Path (2.0 Version)\n\nGovernance (Research & Policy)\n\n Open Door Session: Enhancing LCAP Monitoring & Evaluation: Insights from Riverside COE and Lake Elsinore USD\n\nLEA Leadership and Staff\n\n Universal Design for Learning (UDL) Data Toolkit\n\nGovernance (Research & Policy)\n\n Open Door Session: Driving Safer Schools with Daily Huddles: Hemet USD’s Blueprint for Action and Impact\n\nSEARCH FOR A RESOURCE\n\nNews \n\nand \n\nAnnouncements \n\nHot Topics: LTELs in CA Accountability and Statewide System of Support\n\nMarch 7, 2025\n\nHot Topics: Why School District Turnaround Takes Time—and What CCEE Is Doing About It\n\nMay 28, 2025\n\nNew! Statewide System of Support Virtual Conference\n\nJuly 16, 2025\n\nHot Topics: CA High Quality Online Instructional Materials Initiative Legislative Report\n\nSeptember 29, 2025\n\nBROWSE ALL NEWS\n\n\n\n025\n\nNew! Statewide System of Support Virtual Conference\n\nJuly 16, 2025\n\nHot Topics: CA High Quality Online Instructional Materials Initiative Legislative Report\n\nSeptember 29, 2025\n\nBROWSE ALL NEWS\n\nARTICLE\n\nCCEE Priorities For 2025-26\n\n As the Executive Director of the California Collaborative for Educational Excellence (CCEE), I am excited to share our strategic priorities for the 2025-2026 school year. Our focus will be on four critical areas \n \nLearn More\n\nRequest \n\nCCEE \n\nAssistance\n\nREQUEST ASSISTANCE",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "connection",
        "student",
        "support"
      ]
    },
    {
      "id": 18,
      "title": "safe schools violence prevention.html.txt",
      "description": "Safe Schools & Violence Prevention\nSource: https://www.cde.ca.gov/ls/ss/se/\n\nSchool Environment - Safe Schools (CA Dept of Education)\n\n \n\n \n\nSkip to main content\n\nHome\n\nLearning Support\n\nSafe Schools...",
      "category": "California Guidelines",
      "source": "safe_schools_violence_prevention.html.txt",
      "url": null,
      "chunkCount": 4,
      "fullContent": "Safe Schools & Violence Prevention\nSource: https://www.cde.ca.gov/ls/ss/se/\n\nSchool Environment - Safe Schools (CA Dept of Education)\n\n \n\n \n\nSkip to main content\n\nHome\n\nLearning Support\n\nSafe Schools\n\nSchool Environment\n\n \n\nSchool Environment\n\n Provides training, resources, and technical assistance in the establishment of a school/community environment that is physically and emotionally safe, well disciplined, and conducive to learning.\n \n\nRestorative Practices and School Discipline\n\nA collection of tools and resources regarding restorative practices that educators can use to improve school discipline practices. \n\nBehavioral Intervention Strategies and Supports\n\nWe can keep students in school and hold them accountable. Research on student engagement, academic success, dropout and graduation rates has shown the need to replace punitive discipline practices.\n\nBipartisan Safer Communities Act - Stronger Connections Grant\n\nThe program serves to increase the capacity of Local Educational Ag\n\nn rates has shown the need to replace punitive discipline practices.\n\nBipartisan Safer Communities Act - Stronger Connections Grant\n\nThe program serves to increase the capacity of Local Educational Agencies (LEA) to establish safer and healthier learning environments, prevent and respond to acts of violence and bullying/harassment, address mental health needs, develop safety assessments, corresponding plans and strategies, and promote a positive school climate and culture.\n\nBullying & Hate Motivated Behavior Prevention\n\nProvides resources for parents, administrators, and students on how bullying can be prevented and addressed. Resources include publications, sample policies, and frequently asked questions.\n\nEqual Opportunity & Access\n\nDiscloses the practices of the California Department of Education to ensure equal, fair, and meaningful access to its employment and program services. \n\nPositive School Climate\n\nInformation regarding the importance of positive school climate and resources\n\n Education to ensure equal, fair, and meaningful access to its employment and program services. \n\nPositive School Climate\n\nInformation regarding the importance of positive school climate and resources to improve school climate.\n\nUnsafe School Choice Option Provisions\n\nInformation regarding the Unsafe School Choice Option (USCO) provisions of the No Child Left Behind Act.\n\nSafe and Supportive Schools\n\nSupports statewide measurement of conditions for learning (school climate) and targeted programmatic interventions to improve those conditions.\n\nQuestions:  \n\nSchool Health and Safety Office | 916-319-0914\n\n \n\n \n Last Reviewed: Wednesday, April 02, 2025\n\nTrending in Safe Schools\n\nChild Abuse Identification & Reporting Guidelines\n\nSchool Discipline Information and Resources\n\nComprehensive School Safety Plans\n\nBullying Prevention Training & Resources\n\nChild Abuse Prevention Training and Resources\n\nBullying & Hate-Motivated Behavior Prevention\n\nRestorative Practices and School Discipline\n\nSaf\n\nl Safety Plans\n\nBullying Prevention Training & Resources\n\nChild Abuse Prevention Training and Resources\n\nBullying & Hate-Motivated Behavior Prevention\n\nRestorative Practices and School Discipline\n\nSafe Schools Planning\n\nBehavioral Intervention Strategies and Supports\n\nAdministrator Recommendation of Expulsion Matrix \n\nSafe Schools\n\nMore Trending Items\n\nRecently Posted in Safe Schools\n\n No items posted in the last 60 days.",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "connection",
        "safety",
        "student",
        "support",
        "mental health",
        "behavior",
        "emotion"
      ]
    },
    {
      "id": 32,
      "title": "Reference 4 doi.org",
      "description": "Review of the Literature. The Journal of School Health, 87(7), 554–562. https://doi.org/10.1111/josh.12524. 39. Centers for Disease Control and Prevention. (2024, April). Tips for Understanding and Ad...",
      "category": "External Resources",
      "source": "RRC_Ref_4_doi.org",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Review of the Literature. The Journal of School Health, 87(7), 554–562. https://doi.org/10.1111/josh.12524. 39. Centers for Disease Control and Prevention. (2024, April). Tips for Understanding and Adapting to the Teen Years. Retrieved on June 28, 2025 from https://www.cdc.gov/parenting-teens/tips-understanding-and-adapting/index.html. 40. Mental Health America. (n.d.) Depression in Teens. Retrieved on June 28, 2025 from https://mhanational.org/resources/depression-in-teens/.  41. Stitz, M. E., & Pierce, J. D. (2013). Changes in appearance in the presence of Major stress events. SAGE Open, 3(2), 1–8. https://doi.org/10.1177/2158244013485093. 42. Benzies, K., & Mychasiuk, R. (2009). Fostering family resiliency: A review of the key protective factors. Child & Family Social Work, 14(1), 103-114. https://doi.org/10.1111/j.1365-2206.2008.00586.x.\n\n14. https://doi.org/10.1111/j.1365-2206.2008.00586.x.",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "mental health"
      ]
    },
    {
      "id": 28,
      "title": "RRC Course Content",
      "description": "--- Page 1 ---\n\nIntroduction\nUnderstanding Unique Risk Factors and Warning Signs of Behavioral Health Problems in\nAdolescents\nKnowing the Benefits of Early Detection and Intervention\nBuilding a Supp...",
      "category": "RRC Course Materials",
      "source": "RRC Course",
      "url": null,
      "chunkCount": 52,
      "fullContent": "\n\n--- Page 1 ---\n\nIntroduction\nUnderstanding Unique Risk Factors and Warning Signs of Behavioral Health Problems in\nAdolescents\nKnowing the Benefits of Early Detection and Intervention\nBuilding a Supportive School Community\nRecognize, Respond, Connect: Suppor\u0000ng the\nBehavioral Health of Our Students\n\n--- Page 2 ---\n\n1x\nLesson 1 of 4\nIntroduc\u0000on\nSelect play to listen to the text below.\n039\nEvery student deserves to feel safe, supported, and ready to\nlearn. But that situa\u0000on does not happen on its own.\nSchool staﬀ\nTeachers\nAdministrators\nCounselors\nCustodians\nNutri\u0000on services professionals\nFront oﬃce staﬀ\n\n--- Page 3 ---\n\nCONTINUE\nYard supervisors\nVolunteers\nall play a vital part in shaping how students experience school.\nWhen we show kindness, listen without judgment, or simply\ngreet a student by name, we are doing more than we think. We're\nbuilding connec\u0000on. We're building trust.\nKey Terms\nThroughout the course, all key terms appear in bold italics for easy reference. We encourage y\n\nudent by name, we are doing more than we think. We're\nbuilding connec\u0000on. We're building trust.\nKey Terms\nThroughout the course, all key terms appear in bold italics for easy reference. We encourage you to\ndownload the Key Terms PDF below and use it as you progress through the course.\nClick here to download the PDF for a list of the key terms introduced in this course.\n\n--- Page 4 ---\n\nCONTINUE\nWhen staﬀ create school environments that are suppor\u0000ve, accep\u0000ng, and inclusive, their students\ndo be\u0000er academically and show improved well-being.1\n\n--- Page 5 ---\n\nCONTINUE\nBefore We Begin, a Note About Mandated Repor\u0000ng\nVisit this link to review informa\u0000on for school staﬀ regarding signs of possible abuse and/or neglect\nand how to make a report.2\nAs school staﬀ we are mandated reporters. There may be \u0000mes when we\ninteract with students and families that we learn something that needs\nto be reported. This can be challenging personally and professionally, but\nit should not prevent us from build\n\nay be \u0000mes when we\ninteract with students and families that we learn something that needs\nto be reported. This can be challenging personally and professionally, but\nit should not prevent us from building connec\u0000ons and rela\u0000onships. If\nnecessary, consult with your supervisor to be\u0000er understand if a student\nchallenge, including a behavioral health challenge, needs to be reported.\nFor more informa\u0000on about signs of possible abuse and/or neglect and\nhow to make a report, visit \"Child Abuse Iden\u0000ﬁca\u0000on & Repor\u0000ng\nGuidelines.\"\nChild Abuse Iden\u0000ﬁca\u0000on & Repor\u0000ng Guidelines\nNow let's get back to the task at hand — learning about risk factors and warning signs of behavioral\nhealth challenges in adolescents, and the importance of early interven\u0000on. This training will equip\nyou with prac\u0000cal tools to recognize when a student is in crisis, experiencing a behavioral health\nchallenge, or in need of support. It will also provide guidance on when to make referrals, as\nappropriate.\n\n--- Page 6 ---\n\nN\n\nto recognize when a student is in crisis, experiencing a behavioral health\nchallenge, or in need of support. It will also provide guidance on when to make referrals, as\nappropriate.\n\n--- Page 6 ---\n\nNo ma\u0000er your role, you can have a posi\u0000ve impact on students. You\ncan be a trusted adult.\nYou ma\u0000er to the students at your school. Here's why: School staﬀ help\nshape the human and social condi\u0000ons necessary for students to feel\nconnected to school life. You can encourage resilience, and oﬀer strength\nand stability. You might not always see the impact you are making, but it\nis real, and the connec\u0000ons you make can be life-changing.\nLet's watch a student-made video where school staﬀ share why they con\u0000nue showing up for\nstudents — and the diﬀerence one trusted adult makes.\nThank you to Youth Crea\u0000ng Change at Los Alamitos High School for producing the following video.\nSelect play to view the video.\n\n--- Page 7 ---\n\nCONTINUE\nCONTINUE\nYour Journey Begins Here\nIn this training you will learn s\n\nea\u0000ng Change at Los Alamitos High School for producing the following video.\nSelect play to view the video.\n\n--- Page 7 ---\n\nCONTINUE\nCONTINUE\nYour Journey Begins Here\nIn this training you will learn simple, prac\u0000cal ways to support student well-being. You will learn the\nskills to help iden\u0000fy and refer students experiencing behavioral health challenges. Your job is not to\nsolve every problem or \"ﬁx\" anything or anyone. It is to be present, consistent, and caring within\nscope of your role. We can all make big impacts in our school communi\u0000es through small changes.\nAs you move through this training, some content may feel especially impac\u0000ul or resonate with your\nexperiences. You may think of students or families who may beneﬁt from extra care and services.\nYou can pause the course at any \u0000me and return when you’re ready — your progress will be saved.\nFree resources are available to support you and anyone else in need. Click here to download the RRC\nResources for Learners PDF for more inf\n\n and return when you’re ready — your progress will be saved.\nFree resources are available to support you and anyone else in need. Click here to download the RRC\nResources for Learners PDF for more informa\u0000on.\nReady to deepen your understanding of how trusted adults can support students by crea\u0000ng safe,\nwelcoming school environments? In the next module we will introduce unique risk factors and\nwarning signs of behavioral health problems in adolescents, including the concept of Adverse\nChildhood Experiences — or ACEs — and how they can aﬀect a student's ability to learn, connect, and\nthrive. Understanding the impact of ACEs will help you recognize and respond to signs of stress and\nmore concerning behavioral health disorders.\n\n--- Page 8 ---\n\n1x\nLesson 2 of 4\nUnderstanding Unique Risk Factors and Warning Signsof Behavioral Health Problems in Adolescents\nSelect play to listen to the text below.\n129\nWhat does it take to make school feel like a safe and welcoming\nplace where every student \n\ns and Warning Signsof Behavioral Health Problems in Adolescents\nSelect play to listen to the text below.\n129\nWhat does it take to make school feel like a safe and welcoming\nplace where every student feels supported? For many students,\nschool provides a source of stability when other things in life can\nfeel overwhelming. For students, school can be an opportunity to\nfeel seen, heard, and supported in ways that truly make a\ndiﬀerence.\n\n--- Page 9 ---\n\nCONTINUE\nLet’s Listen to Jaden’s Story\nThis story may be ﬁc\u0000onal, but real versions play out every day in schools across this state. We'll use\nthis story of a student connec\u0000ng with a member of his school's staﬀ to highlight ac\u0000ons we can all\nlearn to take when interac\u0000ng with our own students.\nUse the bu\u0000ons to play, pause, restart this slide, or return to the beginning. You can also move forward or\nback between scenes.\n\n--- Page 10 ---\n\nCONTINUE\nWhat is Behavioral Health? \nBehavioral health includes mental health, substance use, and beha\n\n, or return to the beginning. You can also move forward or\nback between scenes.\n\n--- Page 10 ---\n\nCONTINUE\nWhat is Behavioral Health? \nBehavioral health includes mental health, substance use, and behaviors that can aﬀect a person’s\nwell-being and quality of life. Simply put, behavioral health is about how our thoughts, feelings, and\nac\u0000ons aﬀect how we feel, how we take care of ourselves and our responsibili\u0000es, our rela\u0000onships,\nand our overall well-being.\n\n--- Page 12 ---\n\nCONTINUE\nSchools and school staﬀ can make a diﬀerence in adolescent behavioral health by crea\u0000ng learning\nenvironments where students feel seen, heard, and accepted. School staﬀ can also help students\nbuild resilience and teach them how to manage stress.\nResilience is a person's, family's, or community's ability to adapt and overcome challenges by\nconnec\u0000ng with the strength inside of them and within the groups they belong to, like\nneighborhoods, schools, and cultural groups.\nThis is where understanding one importa\n\npt and overcome challenges by\nconnec\u0000ng with the strength inside of them and within the groups they belong to, like\nneighborhoods, schools, and cultural groups.\nThis is where understanding one important category of unique risk factors called ACEs, can help\nmake a diﬀerence in crea\u0000ng posi\u0000ve learning environments and building resilience.\nWhat are ACEs?\nACEs are tough experiences students might face at home, during homelessness, or while placed in\nout-of-school se\u0000ngs such as foster care.4, 5 These include:\n Abuse or neglect.\nLiving in a home where domes\u0000c violence is happening. \nLiving with a caregiver who struggles with mental health problems or\nsubstance misuse or dependence. \nClick the image below to enlarge it.\n\n--- Page 13 ---\n\nCONTINUE\nThese experiences, and others like them, can be extremely stressful, and disrupt a student’s sense of\nsafety and stability, making it hard to focus in school, build friendships, and feel secure. Without\nearly support, ACEs can increase the risk of \n\nextremely stressful, and disrupt a student’s sense of\nsafety and stability, making it hard to focus in school, build friendships, and feel secure. Without\nearly support, ACEs can increase the risk of developing behavioral health challenges, including\nmental illness or substance use disorders, making early connec\u0000on to trusted adults and support\nservices cri\u0000cal. Early interven\u0000on can make all the diﬀerence in the life of a child who has\nexperienced or is experiencing one or more ACEs.\nHow Common are ACEs?\n\n--- Page 14 ---\n\nBelow is an animated sequence that presents data about the prevalence of ACEs among adults and\nyouth in California.6, 7\nSelect play to view the video.\nTo be\u0000er understand what ACEs are, how common they are, and why they ma\u0000er, let’s take a\nmoment to watch a short video from the California Oﬃce of the Surgeon General. This video\nexplains the science behind ACEs and helps us see how early experiences can shape health and\ndevelopment throughout a person’s life. As we wa\n\nrom the California Oﬃce of the Surgeon General. This video\nexplains the science behind ACEs and helps us see how early experiences can shape health and\ndevelopment throughout a person’s life. As we watch, think about how this informa\u0000on might relate\nto the students we work with every day.\nSelect play to view the video.\n\n--- Page 15 ---\n\nCONTINUE\nThe good news? A trusted adult can make all the diﬀerence in helping\nstudents succeed despite challenges. That’s where WE come in!\nHow ACEs and Toxic Stress Aﬀect the Brain and Body  \nWhy are ACEs such important unique risk factors of behavioral health problems in adolescents?\nWhen we feel a lot of stress, our bodies can go into “survival mode.” In survival mode, we o\u0000en do\nthings like “ﬁght, ﬂight, freeze, or fawn\" to help keep ourselves safe in dangerous situa\u0000ons. But when\nour students have too much stress, or stress that is repeated and lasts a long \u0000me, it can turn into\nsomething called “toxic stress.” This kind of stress can change how ou\n\nangerous situa\u0000ons. But when\nour students have too much stress, or stress that is repeated and lasts a long \u0000me, it can turn into\nsomething called “toxic stress.” This kind of stress can change how our brains and bodies develop\nand make it harder to learn and stay healthy.8 Over \u0000me, toxic stress can even lead to problems like\n\n--- Page 16 ---\n\nanxiety, learning or behavioral problems, or even long-term health issues like heart disease.9, 10\nMany children and adults are living with toxic stress without even knowing it.\nBut stress isn’t always bad. Some lower-level stress, like studying for a big test, can help us learn\nhow to handle stress and grow. The problem occurs when stress is too big or too frequent or never\ngoes away, and students don’t have support to handle it.11\n\n--- Page 17 ---\n\nCONTINUE\nWhat Makes it More Likely That Someone Will Develop\nToxic Stress?\nRisk factors for toxic stress are things that make it more likely someone will experience the toxic\nstress response12 — the\n\n\n\nCONTINUE\nWhat Makes it More Likely That Someone Will Develop\nToxic Stress?\nRisk factors for toxic stress are things that make it more likely someone will experience the toxic\nstress response12 — the prolonged ac\u0000va\u0000on of the stress response systems that can disrupt the\ndevelopment of the brain and body and lead to physical and behavioral health problems.8 ACEs are\nrisk factors for toxic stress and behavioral health problems, but they are not the only risk factors.\nOther risk factors include systemic problems like12:\nExperiencing discrimina\u0000on.\nLiving in poor housing condi\u0000ons.\nNot having enough food.\nBeing separated from parents or caregivers.\nSeeing violence in one’s community. \nAlso, these challenges do not aﬀect everyone the same way. Unfair policies and systems, from the\npast and into the present, have caused some communi\u0000es and groups to face more of these\nproblems. Challenges like these can make it harder for some students and their families to stay safe\nand healthy.8, 12\n\n--- \n\no the present, have caused some communi\u0000es and groups to face more of these\nproblems. Challenges like these can make it harder for some students and their families to stay safe\nand healthy.8, 12\n\n--- Page 18 ---\n\nCONTINUE\nACEs, Toxic Stress, and Health Outcomes Among US High\nSchool Students\nIn a recent study,13 researchers asked over 20,000 students in 9th through 12th grades about their\nexperiences with ACEs and their behaviors, experiences, and choices. The study found that higher\nnumbers of ACEs experienced by students led to an increase in other diﬃcul\u0000es. These included: \nUse the side arrows or select the numbers below the image to scroll through the slides.\n\n--- Page 19 ---\n\nCONTINUE\nThis study shows that ACEs can have a big impact on adolescent's physical and behavioral health\nand well-being as they grow up.\n\n--- Page 20 ---\n\nWomen.\nLiving with limited ﬁnancial resources.\nMembers of the LGBTQ+ community.\nBlack, La\u0000no/a/e*, Indigenous, and other people of color.\nThe Impact of ACE\n\nell-being as they grow up.\n\n--- Page 20 ---\n\nWomen.\nLiving with limited ﬁnancial resources.\nMembers of the LGBTQ+ community.\nBlack, La\u0000no/a/e*, Indigenous, and other people of color.\nThe Impact of ACEs Are Felt More Strongly by Certain\nCommuni\u0000es\nNot everyone has the same chances to be healthy and safe. Where people live and play, the schools\nthey go to, the jobs their families have, and the languages they speak all aﬀect what resources and\nsupport they have. Some communi\u0000es face unfair treatment because of characteris\u0000cs like their\nrace, gender, or family income. This can make life more stressful and harder in many ways. We see\nclear diﬀerences in how o\u0000en people experience ACEs and the poor health outcomes associated\nwith ACEs. Research shows us that there are more nega\u0000ve health outcomes caused by the impact\nof ACEs for people who are8, 12:\n\n--- Page 21 ---\n\n*We recognize that there are various ways to describe people of La\u0000n American descent, including La\u0000nx,\nLa\u0000ne, Hispanic, and o\n\ns caused by the impact\nof ACEs for people who are8, 12:\n\n--- Page 21 ---\n\n*We recognize that there are various ways to describe people of La\u0000n American descent, including La\u0000nx,\nLa\u0000ne, Hispanic, and others. For purposes of this training, we will be using the term \"La\u0000no/a/e.\"14\nWhen people are discriminated against because of who they are, their race/ethnicity, where they\ncome from, what they believe, or who they love, it causes a lot of stress in their communi\u0000es. This\nleads to more health and well-being problems among these communi\u0000es as a result of toxic stress.12\nSome people who have toxic stress adopt health risk behaviors like smoking, substance use, or\noverea\u0000ng to the point of obesity as a way to cope with the stress.15–17, 19  These behaviors can\nalso result in s\u0000gma. This s\u0000gma can keep students from seeking support from a trusted adult at\nschool and worsen the problems that started from toxic stress.\nHere are a few things we can do18, 19:\nNormalize what students are going th\n\nan keep students from seeking support from a trusted adult at\nschool and worsen the problems that started from toxic stress.\nHere are a few things we can do18, 19:\nNormalize what students are going through. \nUse inclusive and nonjudgmental language.\nShow empathy and understanding.\nCreate safe and suppor\u0000ve spaces for students to share their challenges.\nWhich of the following are examples of ACEs that can impact students in a nega\u0000ve way?\nTheir team losing a big game\nExperiencing abuse or neglect\nLiving with a caregiver who struggles with substance misuse or dependence\n\n--- Page 22 ---\n\nSUBMIT\nComplete the content above before moving on.\nThe Power of Support\nResearch shows that just one trusted adult can change a child’s life.20, 21 Teachers, yard supervisors,\ncustodians, and administrators are just a few examples of the many suppor\u0000ve school staﬀ who\nlisten to and support students, helping them feel safe, welcome, and valued.\nSafe, stable, and nurturing environments like suppor\u0000ve scho\n\n are just a few examples of the many suppor\u0000ve school staﬀ who\nlisten to and support students, helping them feel safe, welcome, and valued.\nSafe, stable, and nurturing environments like suppor\u0000ve schools and\nrela\u0000onships with trusted adults help students succeed, no ma\u0000er\nwhat they face inside or outside the classroom.\nHaving a healthy support network of friends\n\n--- Page 23 ---\n\nOne way school staﬀ can make a diﬀerence is by incorpora\u0000ng protec\u0000ve factors into daily\ninterac\u0000ons.\nProtec\u0000ve factors, those inﬂuences in a child’s life that help them learn and grow through\nchallenges, have a huge impact on how much of a toll stress and trauma can take on a student.22\nSafe, stable, and nurturing environments like suppor\u0000ve schools and rela\u0000onships with trusted\nadults can make all the diﬀerence. Other protec\u0000ve factors that can be inﬂuenced by school\ncommuni\u0000es include5, 23: \nPar\u0000cipa\u0000ng in community or cultural tradi\u0000ons.\nFeeling a sense of belonging in school.\nFeeling supported by friends.\n\n Other protec\u0000ve factors that can be inﬂuenced by school\ncommuni\u0000es include5, 23: \nPar\u0000cipa\u0000ng in community or cultural tradi\u0000ons.\nFeeling a sense of belonging in school.\nFeeling supported by friends.\nEvery smile, every check-in, and every encouraging word can help a student navigate challenges\nmore eﬀec\u0000vely. But remember, the well-being of trusted adults ma\u0000ers, too.\n\n--- Page 24 ---\n\n1x\nJust as students need trusted and caring adults, school staﬀ also need a strong support system.\nWhen we take care of ourselves and each other, we create healthier schools and communi\u0000es\nwhere everyone can thrive.\nLet’s check back in on Jaden’s story and see how his teacher was able to use such skills to help\nJaden feel supported. \nUse the bu\u0000ons to play, pause, restart this slide, or return to the beginning. You can also move forward or\nback between scenes.\nSelect play to listen to the text below.\n048\n\n--- Page 25 ---\n\nCONTINUE\nThough Jaden didn’t say much, for the ﬁrst \u0000me in a while, he felt\nno\u0000ce\n\ning. You can also move forward or\nback between scenes.\nSelect play to listen to the text below.\n048\n\n--- Page 25 ---\n\nCONTINUE\nThough Jaden didn’t say much, for the ﬁrst \u0000me in a while, he felt\nno\u0000ced. Jaden’s teacher had ﬁrst connected with him about a\nshared interest before asking about his well-being, which allowed\nthem to establish a connec\u0000on before talking about something\npoten\u0000ally diﬃcult for Jaden. His approach also showed how\nschool staﬀ could acknowledge that students like Jaden might\nhave had problems they didn’t talk about. By showing empathy\nand respect, school staﬀ were able to build trust and help Jaden\nfeel safe and comfortable. It also allowed Jaden to share what he\nwas going through when he was ready and at his own pace.\nHow can we show a student support? Take a look at the examples below to get an idea of how small\nac\u0000ons can let a student know we care.\nSelect each card to reveal more informa\u0000on.\n\n--- Page 26 ---\n\nWhat you can say\n“Hey, I’ve no\u0000ced you’ve been quie\n\n the examples below to get an idea of how small\nac\u0000ons can let a student know we care.\nSelect each card to reveal more informa\u0000on.\n\n--- Page 26 ---\n\nWhat you can say\n“Hey, I’ve no\u0000ced you’ve been quiet\nlately. I just want to check in. Want\nto talk?”\nWhat you can say\n“It’s okay to have tough days. You’re\nnot alone. Would you like to talk\nabout it?\"\nScenario 1\nA middle school teacher no\u0000ces a\nstudent who has stopped turning in\nassignments and avoids making eye\ncontact when interac\u0000ng with\nthe teacher.\nScenario 2\nA nutri\u0000on services\nprofessional overhears a student\nexpressing anger and frustra\u0000on\nwith school.\n\n--- Page 27 ---\n\nCONTINUE\nRecognizing the Signs \nHow can we tell if a student might need addi\u0000onal support? What do the signs and symptoms of\nbehavioral health challenges and more substan\u0000al disorders look like? Let's start with the signs of\ntrauma and toxic stress.\nStudents who have experienced ACEs and toxic stress might:10, 13, 26–32\nSeem \u0000red, sad, distracted, or withdrawn. \nGet\n\nan\u0000al disorders look like? Let's start with the signs of\ntrauma and toxic stress.\nStudents who have experienced ACEs and toxic stress might:10, 13, 26–32\nSeem \u0000red, sad, distracted, or withdrawn. \nGet upset or frustrated easily, or have extreme responses to seemingly\nsmall problems. \nWhat you can say\n“No ma\u0000er what’s going on, you’re\nnot alone. I care about you and I’m\nhere for you.”\nScenario 3\nA coach observes a student athlete\nnot interested in prac\u0000ce and\nno\u0000ceably \u0000red and irritable.\n\n--- Page 28 ---\n\nHave trouble paying a\u0000en\u0000on in class.\nAvoid social ac\u0000vi\u0000es. \nAct out in class or break rules. \nYell or get angry quickly. \nArgue with school staﬀ or other students. \nTake more risks like skipping school. \nUse substances such as: vapes, alcohol, and misusing prescrip\u0000on drugs.\nHave trouble controlling emo\u0000ons, or show few emo\u0000ons or emo\u0000ons\nthat don’t seem to ﬁt the situa\u0000on.\nGet into ﬁghts or show deﬁant behavior. \nA\u0000end class every day but not complete any work. \nHave changes in app\n\ne controlling emo\u0000ons, or show few emo\u0000ons or emo\u0000ons\nthat don’t seem to ﬁt the situa\u0000on.\nGet into ﬁghts or show deﬁant behavior. \nA\u0000end class every day but not complete any work. \nHave changes in appearance or hygiene.\nIt is important to remember signs could indicate a need for support, but can also be early signs of\nserious issues like psychiatric condi\u0000ons and substance use disorders such as opioid and alcohol\nabuse. Instead of asking what’s wrong with this student, we can ask what has happened to this student,\nhow can I help, and/or who do I need to enlist for support?\n\n--- Page 29 ---\n\nCONTINUE\nThere are six trauma-informed principles that we can use to support students who have been\nthrough diﬃcult things.18 They are:\nSelect any principle in the list on the le\u0000 to reveal its image and descrip\u0000on on the right; to view a\ndiﬀerent principle, simply select another item from the list.\n\n--- Page 30 ---\n\nWe play important roles in our school community. Here are some speciﬁc things we ca\n\nd descrip\u0000on on the right; to view a\ndiﬀerent principle, simply select another item from the list.\n\n--- Page 30 ---\n\nWe play important roles in our school community. Here are some speciﬁc things we can do to\nsupport students:\nUse the le\u0000 and right arrows to navigate between the cards and view each topic.\nSome\u0000mes, just\nbeing there is\nenough.\nListen\nwithout\njudgment\n\n--- Page 31 ---\n\n1 of 4\n2 of 4\n3 of 4\nA stable\nenvironment\nhelps students\nfeel safe.\nTeach breathing\nexercises,\nmindfulness, or\njournaling.\nCreate a\npredictable\nrou\u0000ne\nEncourage\nhealthy\ncoping skills\n\n--- Page 32 ---\n\n4 of 4\nCONTINUE\nResilience: The Key to Overcoming Challenges\nWant to be inspired? Know this: ACEs, other hardships, and\nrisk factors don’t deﬁne a child’s future. With support,\nstudents can grow stronger! More good news: safe, stable,\nand suppor\u0000ve rela\u0000onships and environments are\nprotec\u0000ve factors that can lessen the impact of stress and\ntrauma. They help students and communi\u0000es build resilience\n— the abilit\n\nd news: safe, stable,\nand suppor\u0000ve rela\u0000onships and environments are\nprotec\u0000ve factors that can lessen the impact of stress and\ntrauma. They help students and communi\u0000es build resilience\n— the ability to recover and grow from challenges.8, 12, 18, 33-\n35 WE can be protec\u0000ve factors in the lives of the students\nwe see every day by becoming trusted adults.\nTimely support\nfrom school and\ncommunity is\ncrucial to\nstudents.\nKnow when\nto connect\nstudents to\naddi\u0000onal\n\n--- Page 33 ---\n\nSUBMIT\nEvery small act of kindness ma\u0000ers. WE have the power to help students feel seen, heard, and\nsupported. Together, we can create a school where every student feels safe to learn and grow.\nWhat role can school staﬀ play in suppor\u0000ng students’ behavioral health?\n(Check all that apply)\nComplete the content above before moving on.\nSelect play to view the video.\nCrea\u0000ng environments where students feel seen, heard and supported\nHelping students build resilience\nTeaching eﬀec\u0000ve stress management skills\nTrea\u0000ng\n\n before moving on.\nSelect play to view the video.\nCrea\u0000ng environments where students feel seen, heard and supported\nHelping students build resilience\nTeaching eﬀec\u0000ve stress management skills\nTrea\u0000ng behavioral health as solely a clinical responsibility outside the\nclassroom\n\n--- Page 34 ---\n\nCONTINUE\n\n--- Page 35 ---\n\n1x\nLesson 3 of 4\nKnowing the Beneﬁts of Early Detec\u0000on andInterven\u0000on\nSelect play to listen to the text below.\n019\nAs educators and school staﬀ, we play a huge role in students’\nlives — not just in their educa\u0000on, but in their well-being. This\nmodule teaches us to recognize early signs for concern and help\nstudents get the support they need — which can make all the\ndiﬀerence.\n\n--- Page 36 ---\n\nC O N T I N U E \nDid you know that one in six youth experience a behavioral health challenge each year, but only half\nof those who need treatment receive it?36 Not all students who experience challenges need\ntreatment, but all students need support. Research shows that the sooner\n\nth challenge each year, but only half\nof those who need treatment receive it?36 Not all students who experience challenges need\ntreatment, but all students need support. Research shows that the sooner support is provided, the\nbe\u0000er the outcomes. Early support or interven\u0000on leads to:\nBe\u0000er rela\u0000onships and feeling more accepted by classmates.37\nImproved ability to understand and manage feelings.37\nComing to school more o\u0000en, ge\u0000ng be\u0000er grades, and increased belief\nin their ability to do well in school.38\nImproved in-class behaviors and decreased in-school suspensions.38\nRecognizing Our Role as a Trusted Adult \nAs school staﬀ, we build trusted rela\u0000onships with students. Some\u0000mes, we’re the ﬁrst person to\nno\u0000ce when a student might need help. When a student is suddenly quiet, missing assignments, or\nac\u0000ng out in ways that seem out of character, it could be a sign of underlying stress or adversity.\nThese changes may be linked to ACEs or similar adversi\u0000es and other risk factors for beha\n\nnments, or\nac\u0000ng out in ways that seem out of character, it could be a sign of underlying stress or adversity.\nThese changes may be linked to ACEs or similar adversi\u0000es and other risk factors for behavioral\nhealth challenges. As trusted adults, school staﬀ play a key role in recognizing early warning signs,\nunderstanding what a student might be going through, and responding with \u0000mely support,\nincluding appropriate referrals for early interven\u0000on.\nNow that we understand the role of trusted adults, let’s take a moment to hear directly from a\nstudent who experienced a connec\u0000on with a trusted adult about their experience.  \nThank you to Soluna Young Adult Ambassadors for producing the following video.\n\n--- Page 37 ---\n\nC O N T I N U E \nSelect play to view the video.\nWhat can a conversa\u0000on with a trusted adult do for a student who may be going through hard\n\u0000mes?\nIt can ensure that the student will never have problems again\n\n--- Page 38 ---\n\nS U B M I T \nComplete the content above before m\n\nth a trusted adult do for a student who may be going through hard\n\u0000mes?\nIt can ensure that the student will never have problems again\n\n--- Page 38 ---\n\nS U B M I T \nComplete the content above before moving on.\nWhy Early Detec\u0000on Ma\u0000ers\nAs a reminder from module one, early signs of behavioral health\nchallenges aren’t always obvious. They can start with small\nchanges, like:\nIt can force the student to share private informa\u0000on\nIt can open the door to support services\nIt can make the student achieve immediate academic success\n\n--- Page 39 ---\n\nSeeming \u0000red, sad, distracted, or withdrawn.\nGe\u0000ng upset or frustrated easily, or displaying extreme responses to\nseemingly small problems.\nHaving trouble paying a\u0000en\u0000on in class.\nAvoiding social ac\u0000vi\u0000es.\nAc\u0000ng out in class or breaking rules.\nYelling or ge\u0000ng angry quickly.\nArguing with school staﬀ or other students.\nTaking more risks like skipping school.\nSubstance use like vaping, drinking alcohol, and misusing prescrip\u0000on drugs.\nGe\u0000ng into ﬁghts \n\n ge\u0000ng angry quickly.\nArguing with school staﬀ or other students.\nTaking more risks like skipping school.\nSubstance use like vaping, drinking alcohol, and misusing prescrip\u0000on drugs.\nGe\u0000ng into ﬁghts or showing deﬁant behavior.\nA\u0000ending class but not par\u0000cipa\u0000ng in classroom ac\u0000vi\u0000es.\nChanging in appearance or hygiene.\nSome changes in appearance are expected as students learn, grow, and develop, and do not mean\nsomething is wrong. It is common for students to experiment with their appearance, from hair and\nmakeup to clothes and jewelry. For example, students may try new hairstyles, clothing, or ways of\nexpressing who they are that don't follow mainstream fashion or tradi\u0000onal “boy” or “girl” styles.\nThese changes and experimenta\u0000on are a healthy part of growing up and do not need\n\n--- Page 40 ---\n\ninterven\u0000on.39 But if a student’s appearance changes in a way that seems linked to sadness, stress,\nor not taking care of themselves, they may need addi\u0000onal support.40, 41 \nIt’s important to\n\n 40 ---\n\ninterven\u0000on.39 But if a student’s appearance changes in a way that seems linked to sadness, stress,\nor not taking care of themselves, they may need addi\u0000onal support.40, 41 \nIt’s important to be kind and curious when we no\u0000ce changes in a student. Some\u0000mes, changes in\nhow a student looks or acts can be a way of showing that they are going through something that is\nhard for them and may need support. They also might just be their way of showing who they are or\nwhere they come from. If we're not sure what something means, it’s okay to ask gently instead of\nguessing. Some examples of changes that could suggest students may need addi\u0000onal support\ninclude:\nStar\u0000ng to wear the same clothes every day, or clothes that appear worn\nor don't ﬁt well. Alterna\u0000vely, star\u0000ng to wear clothing that is not typical\nfor the student.  \nNot brushing their hair or teeth or having a strong body smell. It is\nimportant to consider if changes in hygiene align with cultural norms.\nOlder children and ado\n\nat is not typical\nfor the student.  \nNot brushing their hair or teeth or having a strong body smell. It is\nimportant to consider if changes in hygiene align with cultural norms.\nOlder children and adolescents o\u0000en experience changes in hygiene as\nthey develop.\n\n--- Page 41 ---\n\nSuddenly looking very \u0000red all the \u0000me, like having dark circles under\ntheir eyes or pu\u0000ng their head down a lot. Alterna\u0000vely, being more\nac\u0000ve and alert than normal for that student.  \nOutside of cultural norms, star\u0000ng to wear long sleeves or lots of layers,\neven when it’s hot, which might mean they’re trying to hide something. \nStopping things they used to enjoy, like not ﬁxing their hair or wearing\ntheir favorite clothes anymore. \nNot showing much emo\u0000on, like not smiling, talking, or making eye\ncontact with others, or showing emo\u0000ons that don't ﬁt the situa\u0000on. \nGe\u0000ng really upset over small things or having a hard \u0000me handling li\u0000le\nproblems.\nNot doing as well in school as they used to.\nShowing signs such\n\nhers, or showing emo\u0000ons that don't ﬁt the situa\u0000on. \nGe\u0000ng really upset over small things or having a hard \u0000me handling li\u0000le\nproblems.\nNot doing as well in school as they used to.\nShowing signs such as red eyes, trouble walking or talking, or laughing a\nlot for no clear reason.\n\n--- Page 42 ---\n\nC O N T I N U E \nWhen we address behavioral health needs early, we can:\nHelp students heal before things get worse.\nEmpower all students to achieve their full poten\u0000al in school and beyond.\nReduce s\u0000gma and make students feel more comfortable asking for help when\nthey need it.\n\n--- Page 43 ---\n\nHow We Can Help\nWe don’t have to be a trained mental health professional to\nhelp. The most important thing is no\u0000cing, listening, and\nconnec\u0000ng students to the right support.\nSelect each card to learn more about how to help if you are concerned about a student.\n\n--- Page 44 ---\n\nAsk how they’re\ndoing in a kind, non-\njudgmental way. \nGive them space to\ntalk and validate\ntheir feelings.\nCheck in\nListen\n\n\n\n about how to help if you are concerned about a student.\n\n--- Page 44 ---\n\nAsk how they’re\ndoing in a kind, non-\njudgmental way. \nGive them space to\ntalk and validate\ntheir feelings.\nCheck in\nListen\n\n--- Page 45 ---\n\nC O N T I N U E \nWhat Do I Do if My Student Needs\nAddi\u0000onal Support?\nFollowing recent policy changes in California, every Local Educa\u0000on Agency (LEA), which includes\nschool districts, county oﬃces of educa\u0000on, direct-funded charter schools, and Special Educa\u0000on\nLocal Plan Areas (SELPAs), will have its own speciﬁc plan to connect students with the support they\nneed. Each LEA will create a plan, called a referral protocol, that outlines the steps a school will take\nwhen a student needs addi\u0000onal support. This helps staﬀ know how to connect students with the\nkind of help they need, like a school counselor or a support program. Because every school\ncommunity is diﬀerent, each LEA’s plan will be a li\u0000le diﬀerent, too, but the goal is always the same:\nto help students feel be\u0000er\n\nd, like a school counselor or a support program. Because every school\ncommunity is diﬀerent, each LEA’s plan will be a li\u0000le diﬀerent, too, but the goal is always the same:\nto help students feel be\u0000er, stay safe, and succeed in school and in life. Check with your supervisor\nto learn about your school’s referral protocol and how to use it.\nShare available\nschool resources,\nlike a counselor or\nbehavioral health\nservices.\nConnect\n\n--- Page 46 ---\n\nModel Referral Protocols for Addressing Pupil Behavioral\nHealth Concerns\nThe California Department of Educa\u0000on provides guidance as a resource for our school\ncommuni\u0000es to support the behavioral well-being of our students. Click the link to review their\nguidance:\nModel Referral Protocols for Addressing Pupil Behavioral Health Concerns\nThere are \u0000mes when a student may need help right away. If you think a student is ac\u0000vely in crisis,\nget help immediately. This applies whether or not the student is known to have behavioral health\nneeds. Students \n\n when a student may need help right away. If you think a student is ac\u0000vely in crisis,\nget help immediately. This applies whether or not the student is known to have behavioral health\nneeds. Students in crisis may:\nCry, yell, or throw things.\nSeem unsafe or dangerous to themselves or others.\nSay they want to harm themselves or others.\nSeem confused or disoriented, not knowing what day it is, where they are, or what they are\ndoing there.\nNot respond to people or their environment, or respond in strange or unexpected ways.\nTalk to themselves or to someone who isn’t there.\nTry to hide or run away from a designated area, which is called eloping.\nAct like a much younger child or mimic animal behavior.\nIf you suspect a student is in crisis:\nTell your supervisor or another appropriate staﬀ member right away.\nTry to stay where you can see the student, but do not follow them closely.\nSpeak in a calm, steady tone of voice to say you are going to get help.\nUse a walkie talkie, radio, or cell phon\n\n right away.\nTry to stay where you can see the student, but do not follow them closely.\nSpeak in a calm, steady tone of voice to say you are going to get help.\nUse a walkie talkie, radio, or cell phone (if available) to call for help.\n\n--- Page 47 ---\n\nC O N T I N U E \nDo not touch the student.\nKeep the student in your sight un\u0000l help arrives.\nOnly individuals with special training should try to intervene when a student is ac\u0000vely in\ncrisis.\nTalk to your supervisor about who should be contacted in case of a crisis. If you’d like to learn more\nabout how to help a student in crisis, you may be interested in the Youth Mental Health First Aid\n(YMHFA) training which you can ﬁnd here.\nConnec\u0000ng Jaden’s Story\nLet's check back in with Jaden and his teacher to see what happened next.\nUse the bu\u0000ons to play, pause, restart this slide, or return to the beginning. You can also move forward or\nback between scenes.\n\n--- Page 48 ---\n\nC O N T I N U E \nOur support could be the reason a student gets the\n\n to play, pause, restart this slide, or return to the beginning. You can also move forward or\nback between scenes.\n\n--- Page 48 ---\n\nC O N T I N U E \nOur support could be the reason a student gets the help\nthey need. We can change their life for the be\u0000er.\nThank you to Soluna Young Adult Ambassadors for producing the following video.\nSelect play to view the video.\n\n--- Page 49 ---\n\nC O N T I N U E \nSelect play to view the following video.\n\n--- Page 50 ---\n\nC O N T I N U E \nWhat can happen when school staﬀ take “early ac\u0000on” to help students?\nStudents become less healthy and strong\nStudents become stronger, healthier, and more resilient\nStudents get more school assignments\n\n--- Page 51 ---\n\nS U B M I T \nComplete the content above before moving on.\nStudents are ignored by their teachers\n\n--- Page 52 ---\n\n1x\nLesson 4 of 4\nBuilding a Suppor\u0000ve School Community\nSelect the play bu\u0000on to listen to the text below.\n0  2 2 \nWe have just learned about unique risk factors including ACEs\nand toxic\n\n Page 52 ---\n\n1x\nLesson 4 of 4\nBuilding a Suppor\u0000ve School Community\nSelect the play bu\u0000on to listen to the text below.\n0  2 2 \nWe have just learned about unique risk factors including ACEs\nand toxic stress, how to iden\u0000fy students facing challenges, and\nsome of the pathways to referral for more support. Now, imagine\na school where every student knows they have at least one adult\nthey can turn to.\nA place where trust is not just a word, but a commitment. Let’s explore how we can help create this\nkind of environment — one where students feel seen, heard, and supported.\n\n--- Page 53 ---\n\nC O N T I N U E \nStudents need to know which adults they can go to when they need help or someone to listen. For\nexample, school staﬀ who want to be iden\u0000ﬁed as trusted adults can wear visible iden\u0000ﬁers like\nstudent-designed pins and bu\u0000ons, or badges and lanyards of a color associated with trust and\ntrustworthiness. Pu\u0000ng up posters on campus also helps to convey to students that we are trusted\nand wel\n\ne\nstudent-designed pins and bu\u0000ons, or badges and lanyards of a color associated with trust and\ntrustworthiness. Pu\u0000ng up posters on campus also helps to convey to students that we are trusted\nand welcoming adults. But being a trusted adult is more than just what we wear — it’s about how we\nact every day. We may ﬁnd that just by being ourselves — perhaps speaking our community’s\nlanguage or wearing something from our home culture — helps students iden\u0000fy us as people who\nmay “get” them.\nHow We Can Make Ourselves Recognizable to Students\non Campus\n\n--- Page 55 ---\n\nSelect each card to ﬂip it and reveal addi\u0000onal content about how school staﬀ can help students iden\u0000fy\ntrusted adults on campus.\nSchool staﬀ wearing visible\niden\u0000ﬁers such as pins or\nlanyards with “Trusted Adult”\nlabels.\nDownload, print, and display the\n“Trusted Adult” badge in your\nworkplace for students to see and\nknow that they are around a person\nthey can talk to. You will receive this\nbadge at the comple\u0000on of this\ncour\n\nd, print, and display the\n“Trusted Adult” badge in your\nworkplace for students to see and\nknow that they are around a person\nthey can talk to. You will receive this\nbadge at the comple\u0000on of this\ncourse.\n\n--- Page 56 ---\n\nBeing a trusted adult also means valuing the culture, language, and\nexperiences of students with marginalized iden\u0000\u0000es. Rather than seeing\nthese factors as barriers, focus on connec\u0000ons that create a sense of\nbelonging. Students need to feel that school staﬀ understand and welcome\nthem, which strengthens the student-staﬀ rela\u0000onships.\nRecognizing students’ cultures, languages, and experiences as both unique assets and personal\nstrengths builds a stronger sense of belonging and resilience.22, 42 This helps create spaces where\nstudents feel seen, heard, and supported in their school community. When students feel that their\nculture and background are understood and respected, they try harder in school, do be\u0000er, and see\nschool as a safe and suppor\u0000ve place.\nHere are some\n\nir school community. When students feel that their\nculture and background are understood and respected, they try harder in school, do be\u0000er, and see\nschool as a safe and suppor\u0000ve place.\nHere are some ways school staﬀ can show they are trustworthy and safe to talk to: \nSmile and say hello to students in the hallways.\nListen without judging when a student wants to talk.\nCheck in with students who seem upset or quiet.\nDisplaying a \"Trusted Adult\"\nbadge helps teachers, custodians,\nnutri\u0000on services professionals,\nand oﬃce staﬀ signal to students\nthat they are approachable.\n\n--- Page 57 ---\n\nUse kind and welcoming words so students feel safe.\nRespect students’ feelings and let them share at their own pace.\nCare about learning/understanding what students’ lives are like.\nSee the box below for instruc\u0000ons on how to maintain pupil privacy and conﬁden\u0000ality in a manner\nconsistent with federal and state privacy laws.\nWhen students know there are trusted adults around them, they feel safer, more\n\nnstruc\u0000ons on how to maintain pupil privacy and conﬁden\u0000ality in a manner\nconsistent with federal and state privacy laws.\nWhen students know there are trusted adults around them, they feel safer, more supported, and\nready to learn!\nWhich of the following is a key characteris\u0000c of a trusted adult? (Check all that apply)\nShare only the informa\u0000on needed to make a referral. This helps protect\nstudent privacy and conﬁden\u0000ality. Keep in mind there are federal and\nstate privacy laws regarding sharing student informa\u0000on. (Click here to\nlearn more about FERPA).\nTo protect the youth's privacy and conﬁden\u0000ality share only what's\nneeded to connect them to trusted supports.\nListen without judging when a student wants to talk\nCheck in with students who seem upset or quiet\nRespect students’ feelings and let them share at their own pace\n\n--- Page 58 ---\n\nS U B M I T \nComplete the content above before moving on.\nThe Role and Impact of Being a Trusted Adult\nMeet Mrs. Lopez, a school Nutri\u0000on Services P\n\n let them share at their own pace\n\n--- Page 58 ---\n\nS U B M I T \nComplete the content above before moving on.\nThe Role and Impact of Being a Trusted Adult\nMeet Mrs. Lopez, a school Nutri\u0000on Services Professional, who began to no\u0000ce a student who\nalways sat alone at lunch. Instead of simply walking by, she chose to check in. Over \u0000me, small\nconversa\u0000ons turned into a bond between the student and Mrs. Lopez, a trusted adult who\nlistened. These moments — however small — can change lives.\nShare personal opinions and judgments freely\n\n--- Page 60 ---\n\nC O N T I N U E \nC O N T I N U E \nKey Takeaways\nUse these ac\u0000ons to support students more eﬀec\u0000vely:\nEngaging in authen\u0000c, meaningful interac\u0000ons.\nAc\u0000vely listening and showing empathy.\nCrea\u0000ng welcoming spaces for students to express themselves.\nModule one introduced protec\u0000ve factors that can act as cri\u0000cal buﬀers to reduce risk factors at\npersonal, family, and community levels. Let's review them now.\nClick the arrows to explore how diﬀerent\n\nModule one introduced protec\u0000ve factors that can act as cri\u0000cal buﬀers to reduce risk factors at\npersonal, family, and community levels. Let's review them now.\nClick the arrows to explore how diﬀerent protec\u0000ve factors can help buﬀer stress and promote well-being.\nProtec\u0000ve Factors as Buﬀers to Reduce Risk Factors\n\n--- Page 61 ---\n\nPersonal Level: Taking care of ourselves helps us take care of\nothers. This means se\u0000ng boundaries, making \u0000me for rest, and\nﬁnding healthy ways to recharge — like prac\u0000cing mindfulness,\nexercising, or talking with a friend.\n\n--- Page 62 ---\n\nFamily Level: Support from loved ones can make a big diﬀerence.\nWhether it’s sharing responsibili\u0000es at home, having open\nconversa\u0000ons about stress, or simply spending quality \u0000me\ntogether, family connec\u0000ons can be a source of strength.\n\n--- Page 63 ---\n\nCommunity Level: Schools, coworkers, and local organiza\u0000ons\nplay a big role in staﬀ well-being. When workplaces encourage\nbalance, provide mental health support, and fo\n\n of strength.\n\n--- Page 63 ---\n\nCommunity Level: Schools, coworkers, and local organiza\u0000ons\nplay a big role in staﬀ well-being. When workplaces encourage\nbalance, provide mental health support, and foster a culture of\ncare and apprecia\u0000on, staﬀ feel valued and supported.\nDrag each number to the category it best ﬁts: Personal, Family, or Community level. If correct, feedback\nwill appear. If incorrect, the number will turn into an \"X\".\nProtec\u0000ve Factors: A Case Example with Jaden\nLet's return to Jaden's story and see how a trusted adult can help him make the most of his\nprotec\u0000ve factors.\n\n--- Page 64 ---\n\nIn our example, Jaden's teacher honoring his love for soccer highlights the fact that sports, hobbies,\nand extracurricular ac\u0000vates can be an eﬀec\u0000ve outlet or “stress buster” for coping with ongoing\nstress at home. Playing a sport has many beneﬁts, including building stronger rela\u0000onships with\npeers while also ge\u0000ng lots of physical ac\u0000vity, which further support the well-being and\nde\n\nith ongoing\nstress at home. Playing a sport has many beneﬁts, including building stronger rela\u0000onships with\npeers while also ge\u0000ng lots of physical ac\u0000vity, which further support the well-being and\ndevelopment of students, including Jaden.\nJaden’s rela\u0000onship with a trusted adult, built on support and an acknowledgement of Jaden’s\nstrengths, helps him feel seen, heard, and supported. A\u0000er iden\u0000fying the reasons for Jaden’s\nbehavior changes, school staﬀ collaborated with him to develop a plan, placing Jaden at the center\nas the primary decision-maker about solu\u0000ons he felt would work best for him. A key element of\nJaden’s plan was to con\u0000nue having check-ins with a trusted adult.\nA\u0000er a few chats with his trusted adult, Jaden accepted a referral to the school counselor. He and\nthe counselor discussed addi\u0000onal ways to manage stress, strengthen his conﬁdence, set goals, and\nbuild resilience. It wasn’t always easy, but with the support of trusted adults, Jaden kept showing\nup. This experi\n\n discussed addi\u0000onal ways to manage stress, strengthen his conﬁdence, set goals, and\nbuild resilience. It wasn’t always easy, but with the support of trusted adults, Jaden kept showing\nup. This experience with a trusted adult, in addi\u0000on to building on Jaden’s strengths, ul\u0000mately\n\n--- Page 65 ---\n\nC O N T I N U E \ncontributed to his ability to thrive. Jaden s\u0000ll has hard days, but now he has tools, someone he\ntrusts, and a sense of purpose. This makes all the diﬀerence.\nSpeciﬁcally, Jaden showed the following improvements:    \nHe developed a stronger sense of self-worth and his\nconﬁdence grew. \nHe maintained an outlook on life was posi\u0000ve even\nwhen facing new adversi\u0000es. \nHis social connec\u0000ons and peer rela\u0000onships became\nstronger. \nHe stopped showing up late to class. \nHe developed a strong interest in pursuing a career in\nbehavioral health, inspired by the trauma-informed care\nhe received and the ongoing interac\u0000ons with trusted\nadults and their posi\u0000ve impact.\n\n--- Page 66 ---\n\nC O\n\nong interest in pursuing a career in\nbehavioral health, inspired by the trauma-informed care\nhe received and the ongoing interac\u0000ons with trusted\nadults and their posi\u0000ve impact.\n\n--- Page 66 ---\n\nC O N T I N U E \nAlthough not the purpose of the teacher's interven\u0000on,\nJaden also improved academically.\nTrust isn’t always immediate. Some students may be hesitant due to past experiences, but pa\u0000ence\nand genuine care can break down walls. \nKey Learning Points\nTrustworthiness and rela\u0000onships take \u0000me to build, but they can develop\neven a\u0000er a rocky start.\nTrusted adults play a crucial role in fostering resilience.\nStudents’ unique cultures, languages, and experiences also serve as powerful\nprotec\u0000ve factors. \nThese points highlight how building trust, recognizing students’ strengths, and serving as trusted\nadults on campus allow school staﬀ to recognize early warning signs, respond eﬀec\u0000vely to\nbehavioral health needs, and connect students to appropriate supports and \u0000mely interven\u0000ons.\nTh\n\nng as trusted\nadults on campus allow school staﬀ to recognize early warning signs, respond eﬀec\u0000vely to\nbehavioral health needs, and connect students to appropriate supports and \u0000mely interven\u0000ons.\nThink of a \u0000me when you helped a student feel safe. What did you do,\nand what was the impact?\nLet's watch a student-made video that describes how one trusted adult can change a life.\n\n--- Page 67 ---\n\nC O N T I N U E \nSchool staﬀ comple\u0000ng this training will receive a printable poster and badge to display in your workplace. You\nwill also be invited to join a larger learning community and become part of a vital network of trusted adults\nwho champion student well-being. Lookout for an email following your comple\u0000on of the course.\nThank you to Youth Crea\u0000ng Change at Los Alamitos High School for producing the following video.\nSelect play to view the video.\nTrusted Adult Poster and Badge\n\n--- Page 68 ---\n\nC O N T I N U E \nResources & Call to Ac\u0000on \nWe don’t have to do this work alone. Let’s expl\n\noducing the following video.\nSelect play to view the video.\nTrusted Adult Poster and Badge\n\n--- Page 68 ---\n\nC O N T I N U E \nResources & Call to Ac\u0000on \nWe don’t have to do this work alone. Let’s explore these resources to strengthen our impact.\nClick here to download the complete course key terms (glossary) — remember, the key terms\nappeared in bold italics throughout the course for your reference.\nClick here to access the references sheet for this course\n\n--- Page 69 ---\n\nC O N T I N U E \nC O N T I N U E \nTogether, let's create a school community where every student knows they are seen, truly valued,\nand connected.\nSelect play to view the following video.\n\n--- Page 70 ---\n\nThank you for taking this course. Click the Exit Course bu\u0000on in the top right of the screen to exit.\nPlease complete the evalua\u0000on to receive your cer\u0000ﬁcate of comple\u0000on, Con\u0000nuing Educa\u0000on\ncredits, and \"Trusted Adult\" poster/badge.\n\ne the evalua\u0000on to receive your cer\u0000ﬁcate of comple\u0000on, Con\u0000nuing Educa\u0000on\ncredits, and \"Trusted Adult\" poster/badge.",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "trauma",
        "aces",
        "toxic stress",
        "resilience",
        "safety",
        "classroom",
        "student",
        "teacher",
        "support",
        "mental health"
      ]
    },
    {
      "id": 1,
      "title": "academic social emotional learning.html.txt",
      "description": "Academic, Social, and Emotional Learning\nSource: https://www.cde.ca.gov/ci/se/academicsocialemotionallearning.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and...",
      "category": "RRC Course Materials",
      "source": "academic_social_emotional_learning.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Academic, Social, and Emotional Learning\nSource: https://www.cde.ca.gov/ci/se/academicsocialemotionallearning.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n f5a2420b-ctxv-4bf2-8d25-6c6529be33a3\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ci/se/academicsocialemotionallearning.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:22:02 UTC\n\nrom\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:22:02 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior",
        "emotion"
      ]
    },
    {
      "id": 2,
      "title": "bullying cyberbullying prevention.html.txt",
      "description": "Bullying & Cyberbullying Prevention\nSource: https://www.cde.ca.gov/ls/ss/se/bullyres.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site ma...",
      "category": "RRC Course Materials",
      "source": "bullying_cyberbullying_prevention.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Bullying & Cyberbullying Prevention\nSource: https://www.cde.ca.gov/ls/ss/se/bullyres.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n f70947c3-ctxv-4ba0-b45b-b11ae4b39ab6\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/se/bullyres.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:52 UTC\n\n0:21:52 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 3,
      "title": "california mtss.html.txt",
      "description": "California MTSS\nSource: https://www.cde.ca.gov/ci/cr/mt/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot....",
      "category": "RRC Course Materials",
      "source": "california_mtss.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "California MTSS\nSource: https://www.cde.ca.gov/ci/cr/mt/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n c081a8b6-ctxv-40b0-b150-2939dcf15a54\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ci/cr/mt/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:49 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 4,
      "title": "california resilience project.html.txt",
      "description": "California Resilience Project\nSource: https://www.cde.ca.gov/ls/ss/se/resilienceproject.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site...",
      "category": "RRC Course Materials",
      "source": "california_resilience_project.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "California Resilience Project\nSource: https://www.cde.ca.gov/ls/ss/se/resilienceproject.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n ef52aa92-ctxv-4a54-a815-bdb58b5086ce\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/se/resilienceproject.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:22:02 UTC\n\nr 31 2025, 00:22:02 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "resilience",
        "behavior"
      ]
    },
    {
      "id": 5,
      "title": "california sel.html.txt",
      "description": "Social and Emotional Learning in California\nSource: https://www.cde.ca.gov/ci/se/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us t...",
      "category": "RRC Course Materials",
      "source": "california_sel.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "Social and Emotional Learning in California\nSource: https://www.cde.ca.gov/ci/se/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 96aa47fb-ctxv-4012-93e2-4ebbfcbc4a86\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ci/se/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:49 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior",
        "emotion"
      ]
    },
    {
      "id": 7,
      "title": "child abuse prevention training.html.txt",
      "description": "Child Abuse Prevention & Training\nSource: https://www.cde.ca.gov/ls/ss/ap/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think th...",
      "category": "RRC Course Materials",
      "source": "child_abuse_prevention_training.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "Child Abuse Prevention & Training\nSource: https://www.cde.ca.gov/ls/ss/ap/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n a26e5e65-ctxv-4099-b4a2-ae730fc28356\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/ap/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:56 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 8,
      "title": "comprehensive school safety plans.html.txt",
      "description": "Comprehensive School Safety Plans\nSource: https://www.cde.ca.gov/ls/ss/vp/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think th...",
      "category": "RRC Course Materials",
      "source": "comprehensive_school_safety_plans.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "Comprehensive School Safety Plans\nSource: https://www.cde.ca.gov/ls/ss/vp/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n a7c540b0-ctxv-47c4-82ba-c0f322c243da\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/vp/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:53 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "safety",
        "behavior"
      ]
    },
    {
      "id": 9,
      "title": "emergency response crisis management.html.txt",
      "description": "Emergency Response & Crisis Management\nSource: https://www.cde.ca.gov/ls/ss/vp/emresponse.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this si...",
      "category": "RRC Course Materials",
      "source": "emergency_response_crisis_management.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Emergency Response & Crisis Management\nSource: https://www.cde.ca.gov/ls/ss/vp/emresponse.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n bed85823-ctxv-4208-a88a-ca40d5c831d6\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/vp/emresponse.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:22:01 UTC\n\n2025, 00:22:01 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 10,
      "title": "foster youth services.html.txt",
      "description": "Foster Youth Services Coordinating Program\nSource: https://www.cde.ca.gov/ls/pf/fy/fyscp.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this sit...",
      "category": "RRC Course Materials",
      "source": "foster_youth_services.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Foster Youth Services Coordinating Program\nSource: https://www.cde.ca.gov/ls/pf/fy/fyscp.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 90021dad-ctxv-4524-9cf1-aba1cb61e620\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/pf/fy/fyscp.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:58 UTC\n\n00:21:58 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 11,
      "title": "homeless education.html.txt",
      "description": "Homeless Education (McKinney-Vento)\nSource: https://www.cde.ca.gov/sp/hs/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think tha...",
      "category": "RRC Course Materials",
      "source": "homeless_education.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "Homeless Education (McKinney-Vento)\nSource: https://www.cde.ca.gov/sp/hs/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n c813c686-ctxv-4324-af48-abda4454ae7a\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/sp/hs/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:58 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 12,
      "title": "human trafficking prevention education.html.txt",
      "description": "Human Trafficking Prevention Education\nSource: https://www.cde.ca.gov/ls/cg/mg/hteducators.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this s...",
      "category": "RRC Course Materials",
      "source": "human_trafficking_prevention_education.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Human Trafficking Prevention Education\nSource: https://www.cde.ca.gov/ls/cg/mg/hteducators.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n c91bdda7-ctxv-4937-91e8-a6c71c907733\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/cg/mg/hteducators.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:56 UTC\n\n1 2025, 00:21:56 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 13,
      "title": "lgbtq resources.html.txt",
      "description": "LGBTQ+ Resources\nSource: https://www.cde.ca.gov/ls/ss/se/lgbtqresources.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think t...",
      "category": "RRC Course Materials",
      "source": "lgbtq_resources.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "LGBTQ+ Resources\nSource: https://www.cde.ca.gov/ls/ss/se/lgbtqresources.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n fbfecd99-ctxv-452f-9941-c9c238a3b571\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/se/lgbtqresources.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:22:01 UTC\n\n UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 14,
      "title": "positive behavior interventions supports.html.txt",
      "description": "Positive Behavioral Interventions & Supports\nSource: https://www.cde.ca.gov/ls/ss/se/pbis.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this si...",
      "category": "RRC Course Materials",
      "source": "positive_behavior_interventions_supports.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Positive Behavioral Interventions & Supports\nSource: https://www.cde.ca.gov/ls/ss/se/pbis.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 6d60a9c5-ctxv-4d79-8e55-579fab973c55\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/se/pbis.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:22:03 UTC\n\n00:22:03 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "support",
        "behavior"
      ]
    },
    {
      "id": 15,
      "title": "restorative practices.html.txt",
      "description": "Restorative Practices Resources\nSource: https://www.cde.ca.gov/ls/ss/se/restorativepractices.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this...",
      "category": "RRC Course Materials",
      "source": "restorative_practices.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Restorative Practices Resources\nSource: https://www.cde.ca.gov/ls/ss/se/restorativepractices.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 2d9a3547-ctxv-487c-88cf-66d7fec405ad\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/se/restorativepractices.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:50 UTC\n\n \nOctober 31 2025, 00:21:50 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 16,
      "title": "safe havens immigrant students.html.txt",
      "description": "Safe Havens for Immigrant Students\nSource: https://www.cde.ca.gov/re/di/isd/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think...",
      "category": "RRC Course Materials",
      "source": "safe_havens_immigrant_students.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "Safe Havens for Immigrant Students\nSource: https://www.cde.ca.gov/re/di/isd/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n be541d71-ctxv-4251-ab22-e41c40022a6a\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/re/di/isd/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:57 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "student",
        "behavior"
      ]
    },
    {
      "id": 17,
      "title": "safe schools for all.html.txt",
      "description": "Safe Schools for All Hub\nSource: https://schools.covid19.ca.gov/\n\nOffice of School Health Hub\n\n×\n\nThe federal government has shut down due to the failures of the President and Congress to continue gov...",
      "category": "RRC Course Materials",
      "source": "safe_schools_for_all.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Safe Schools for All Hub\nSource: https://schools.covid19.ca.gov/\n\nOffice of School Health Hub\n\n×\n\nThe federal government has shut down due to the failures of the President and Congress to continue government funding.\n Millions of Californians receiving benefits from state programs may be impacted. For now, California’s Special Supplemental Nutrition Program for Women, Infants, and Children (WIC) will continue to provide services and enroll eligible families as long as funding is available. No new federal funding to California WIC will be provided until the President and Congress take action. Families should continue to use their WIC benefits and attend their WIC appointments. This information is subject to change, so please monitor the\n \nCalifornia WIC website\n for updates.\n \n\n Please be wary of potential highly partisan political messaging while visiting federal government websites for information related to the federal government shutdown.\n\nary of potential highly partisan political messaging while visiting federal government websites for information related to the federal government shutdown.",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": []
    },
    {
      "id": 19,
      "title": "safe supportive schools program.html.txt",
      "description": "Safe and Supportive Schools Program\nSource: https://www.cde.ca.gov/ls/ss/se/safesupportive.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this s...",
      "category": "RRC Course Materials",
      "source": "safe_supportive_schools_program.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Safe and Supportive Schools Program\nSource: https://www.cde.ca.gov/ls/ss/se/safesupportive.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 9b737bf9-ctxv-4d4f-8aa4-159ec26adaa5\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/se/safesupportive.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:48 UTC\n\nr 31 2025, 00:21:48 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "support",
        "behavior"
      ]
    },
    {
      "id": 27,
      "title": "sample.txt",
      "description": "Sample Document for RAG System\n\nThis is a sample document to demonstrate the RAG (Retrieval-Augmented Generation) capabilities of the AI chatbot.\n\nAbout RAG:\nRAG stands for Retrieval-Augmented Generat...",
      "category": "RRC Course Materials",
      "source": "sample.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Sample Document for RAG System\n\nThis is a sample document to demonstrate the RAG (Retrieval-Augmented Generation) capabilities of the AI chatbot.\n\nAbout RAG:\nRAG stands for Retrieval-Augmented Generation. It's a technique that enhances AI responses by first retrieving relevant information from a knowledge base, then using that information to generate more accurate and contextual responses.\n\nHow it works:\n1. Documents are uploaded to the system\n2. They are split into chunks and converted to vector embeddings\n3. When a user asks a question, the system searches for relevant chunks\n4. The AI uses these chunks as context to generate a response\n\nBenefits:\n- More accurate responses based on your specific documents\n- Reduces hallucinations by grounding responses in real data\n- Allows the AI to answer questions about your proprietary information\n- Can be updated in real-time by adding or removing documents\n\nExample Questions:\nTry asking:\n- \"What is RAG?\"\n- \"How does the system work?\"\n- \"What ar\n\nwer questions about your proprietary information\n- Can be updated in real-time by adding or removing documents\n\nExample Questions:\nTry asking:\n- \"What is RAG?\"\n- \"How does the system work?\"\n- \"What are the benefits of using RAG?\"\n\nThe chatbot will use this document to provide accurate answers!\n",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": []
    },
    {
      "id": 20,
      "title": "school attendance review boards.html.txt",
      "description": "School Attendance Review Boards\nSource: https://www.cde.ca.gov/ls/ai/sb/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that...",
      "category": "RRC Course Materials",
      "source": "school_attendance_review_boards.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "School Attendance Review Boards\nSource: https://www.cde.ca.gov/ls/ai/sb/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 8bb52078-ctxv-46cd-90d9-01138ca3f6f6\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ai/sb/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:22:00 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 21,
      "title": "school climate health safety.html.txt",
      "description": "School Climate, Health, and Safety\nSource: https://www.cde.ca.gov/ls/ss/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that...",
      "category": "RRC Course Materials",
      "source": "school_climate_health_safety.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "School Climate, Health, and Safety\nSource: https://www.cde.ca.gov/ls/ss/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n d4169c86-ctxv-4939-82cd-078eff53a7a0\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:48 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "safety",
        "behavior"
      ]
    },
    {
      "id": 22,
      "title": "school mental health.html.txt",
      "description": "School Mental Health\nSource: https://www.cde.ca.gov/ls/cg/mh/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a...",
      "category": "RRC Course Materials",
      "source": "school_mental_health.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "School Mental Health\nSource: https://www.cde.ca.gov/ls/cg/mh/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 08a51fcd-ctxv-4ff8-bfdf-482c19c6a8aa\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/cg/mh/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:54 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "mental health",
        "behavior"
      ]
    },
    {
      "id": 23,
      "title": "school nutrition programs.html.txt",
      "description": "School Nutrition Programs\nSource: https://www.cde.ca.gov/ls/nu/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are...",
      "category": "RRC Course Materials",
      "source": "school_nutrition_programs.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "School Nutrition Programs\nSource: https://www.cde.ca.gov/ls/nu/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n fc126d64-ctxv-48a6-98e5-4e5c5fd2d9cf\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/nu/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:59 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 24,
      "title": "special education family resources.html.txt",
      "description": "Special Education Family & Community Resources\nSource: https://www.cde.ca.gov/sp/se/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made u...",
      "category": "RRC Course Materials",
      "source": "special_education_family_resources.html.txt",
      "url": null,
      "chunkCount": 1,
      "fullContent": "Special Education Family & Community Resources\nSource: https://www.cde.ca.gov/sp/se/\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n 65378e37-ctxv-401e-b55c-7eac692a5850\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/sp/se/\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:59 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 25,
      "title": "suicide prevention resources.html.txt",
      "description": "Suicide Prevention Resources\nSource: https://www.cde.ca.gov/ls/cg/mh/suicideprevres.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site mad...",
      "category": "RRC Course Materials",
      "source": "suicide_prevention_resources.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Suicide Prevention Resources\nSource: https://www.cde.ca.gov/ls/cg/mh/suicideprevres.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n de5e2b18-ctxv-4465-8804-4928acad32ad\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/cg/mh/suicideprevres.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:53 UTC\n\n25, 00:21:53 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "behavior"
      ]
    },
    {
      "id": 26,
      "title": "trauma informed schools.html.txt",
      "description": "Trauma-Informed Schools\nSource: https://www.cde.ca.gov/ls/ss/se/traumainformed.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us...",
      "category": "RRC Course Materials",
      "source": "trauma_informed_schools.html.txt",
      "url": null,
      "chunkCount": 2,
      "fullContent": "Trauma-Informed Schools\nSource: https://www.cde.ca.gov/ls/ss/se/traumainformed.asp\n\nRadware Captcha Page\n\nWe apologize for the inconvenience...\n\n...but your activity and behavior on this site made us think that you are a bot.\n\nNote:\n A number of things could be going on here.\n\nIf you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessing site again.\n\nDue to previously detected malicious behavior which originated from the network you're using, please request unblock to site.\n\nIncident ID:\n fbcc0d7a-ctxv-4d9b-8fe4-b6020576298c\n\n Please solve this CAPTCHA to request unblock to the website \n\n You reached this page when trying to access\n \nhttps://www.cde.ca.gov/ls/ss/se/traumainformed.asp\n from\n \n172.56.244.135\n on\n \nOctober 31 2025, 00:21:51 UTC\n\n0:21:51 UTC",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "trauma",
        "behavior"
      ]
    },
    {
      "id": 29,
      "title": "Reference 1 www.apa.org",
      "description": "Recognize, Respond, Connect:  Supporting the Behavioral Health of Our Students References  1. Rimm-Kaufman, S. (2015, March 9). Improving students' relationships with teachers to provide essential sup...",
      "category": "Research & Evidence",
      "source": "RRC_Ref_1_www.apa.org",
      "url": null,
      "chunkCount": 4,
      "fullContent": "Recognize, Respond, Connect:  Supporting the Behavioral Health of Our Students References  1. Rimm-Kaufman, S. (2015, March 9). Improving students' relationships with teachers to provide essential supports for learning. American Psychological Association. https://www.apa.org/education-career/k12/relationships. 2. California Department of Education. (n.d.). Child abuse identification & reporting guidelines. https://www.cde.ca.gov/ls/ss/ap/childabusereportingguide.asp.  3. Center for Medicare and Medicaid Services. (2023, July 16). Roadmap to behavioral health: Guide to mental health and substance use disorder services. Retrieved April 10, 2025 from https://www.cms.gov/About-CMS/Agency-Information/OMH/Downloads/Roadmap-to-Behavioral-Health-508-Updated-2018.pdf 4. Felitti, V. J., Anda, R. F., Nordenberg, D., Williamson, D. F., Spitz, A. M., Edwards, V., Koss, M. P., & Marks, J. S. (1998). Relationship of childhood abuse and household dysfunction to many of the leading causes of death in a\n\n Nordenberg, D., Williamson, D. F., Spitz, A. M., Edwards, V., Koss, M. P., & Marks, J. S. (1998). Relationship of childhood abuse and household dysfunction to many of the leading causes of death in adults. The Adverse Childhood Experiences (ACE) Study. American Journal of Preventive Medicine, 14(4), 245–258. https://doi.org/10.1016/s0749-3797(98)00017-8.  5. Dube, S. R., Felitti, V. J., Dong, M., Giles, W. H., & Anda, R. F. (2003). The impact of adverse childhood experiences on health problems: evidence from four birth cohorts dating back to 1900. Preventive Medicine, 37(3), 268–277. https://doi.org/10.1016/s0091-7435(03)00123-3.   6. California Health Interview Survey. (2022, October). CHIS 2021 Adult Survey. UCLA Center for Health Policy Research. Retrieved on March 15, 2025 from https://healthpolicy.ucla.edu/our-work/california-health-interview-survey-chis.  7. U.S. Department of Health and Human Services. (2023, April). National Survey of Children's Health. https://www.kidsdata.or\n\n//healthpolicy.ucla.edu/our-work/california-health-interview-survey-chis.  7. U.S. Department of Health and Human Services. (2023, April). National Survey of Children's Health. https://www.kidsdata.org/topic/2214/aces-nsch-number/Pie#fmt=2760&loc=2,1&tf=159&ch=1256,1454,1455,1457,1259&pdist=172 8. National Academies of Sciences, Engineering, and Medicine; Health and Medicine Division; Board on Population Health and Public Health Practice; Committee on Applying Neurobiological and Socio-Behavioral Sciences from Prenatal Through Early Childhood Development: A Health Equity Approach, Negussie, Y., Geller, A., & DeVoe, J. E. (Eds.). (2019). Vibrant and healthy kids: Aligning science, practice, and policy to advance health equity. National Academies Press (US). https://doi.org/10.17226/25466. 9. Hughes, K., Bellis, M. A., Hardcastle, K. A., Sethi, D., Butchart, A., Mikton, C., Jones, L., & Dunne, M. P. (2017). The effect of multiple adverse childhood experiences on health: A systematic revi\n\n. Hughes, K., Bellis, M. A., Hardcastle, K. A., Sethi, D., Butchart, A., Mikton, C., Jones, L., & Dunne, M. P. (2017). The effect of multiple adverse childhood experiences on health: A systematic review and meta-analysis. The Lancet Public Health, 2(8), e356–e366. https://doi.org/10.1016/S2468-2667(17)30118-4. 10. Burke, N. J., Hellman, J. L., Scott, B. G., Weems, C. F., & Carrion, V. G. (2011). The impact of adverse childhood experiences on an urban pediatric population. Child abuse & neglect, 35(6), 408–413. https://doi.org/10.1016/j.chiabu.2011.02.006.",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "aces",
        "relationship",
        "student",
        "teacher",
        "support",
        "mental health",
        "behavior"
      ]
    },
    {
      "id": 30,
      "title": "Reference 2 doi.org",
      "description": "11. Bucci, M., Marques, S. S., Oh, D., & Harris, N. B. (2016). Toxic stress in children and adolescents. Advances in Pediatrics, 63(1), 403–428. https://doi.org/10.1016/j.yapd.2016.04.002. 12. Bhushan...",
      "category": "Research & Evidence",
      "source": "RRC_Ref_2_doi.org",
      "url": null,
      "chunkCount": 6,
      "fullContent": "11. Bucci, M., Marques, S. S., Oh, D., & Harris, N. B. (2016). Toxic stress in children and adolescents. Advances in Pediatrics, 63(1), 403–428. https://doi.org/10.1016/j.yapd.2016.04.002. 12. Bhushan, D., Kotz, K., McCall, J., Wirtz, S., Gilgoff, R., Rishi Dube, S., Powers, C., Olson-Morgan, J., Galeste, M., Patterson, K., Harris, L., Mills, A., Bethell, C., & Burke Harris, N. (2020). The roadmap for resilience: The California Surgeon General’s report on adverse childhood experiences, toxic stress, and health. Office of the California Surgeon General. https://doi.org/10.48019/PEAM8812. 13. Swedo, E. A., Pampati S, Anderson KN, et al. (2023). Adverse childhood experiences and health conditions and risk behaviors among high school students — Youth Risk Behavior Survey, United States, 2023. MMWR Supplements, 73(Suppl-4), 39–49. http://dx.doi.org/10.15585/mmwr.su7304a5. 14. Miranda, A. R., Perez-Brumer, A., & Charlton, B. M. (2023). Latino? Latinx? Latine? A call for inclusive categories \n\nMMWR Supplements, 73(Suppl-4), 39–49. http://dx.doi.org/10.15585/mmwr.su7304a5. 14. Miranda, A. R., Perez-Brumer, A., & Charlton, B. M. (2023). Latino? Latinx? Latine? A call for inclusive categories in epidemiologic research, American Journal of Epidemiology, 192(12), 1929–1932, https://doi.org/10.1093/aje/kwad149. 15. Bellis, M. A., Ashton, K., Hughes, K., Ford, K. J., Bishop, J., & Paranjothy, S. (2016). Adverse childhood experiences and their impact on health-harming behaviours in the Welsh adult population. https://researchonline.ljmu.ac.uk/id/eprint/2648. 16. Petruccelli, K., Davis, J., & Berman, T. (2019). Adverse childhood experiences and associated health outcomes: A systematic review and meta-analysis. Child Abuse & Neglect, 97, 104127. https://doi.org/10.1016/j.chiabu.2019.104127. 17. Felitti, V. J., Jakstis, K., Pepper, V., & Ray, A. (2010). Obesity: problem, solution, or both?. The Permanente Journal, 14(1), 24–30. https://doi.org/10.7812/TPP/10.996.  18. Substance Abuse a\n\n7. 17. Felitti, V. J., Jakstis, K., Pepper, V., & Ray, A. (2010). Obesity: problem, solution, or both?. The Permanente Journal, 14(1), 24–30. https://doi.org/10.7812/TPP/10.996.  18. Substance Abuse and Mental Health Services Administration. (2014). SAMHSA’s concept of trauma and guidance for a trauma-informed approach (HHS Publication No. SMA 14-4884). U.S. Department of Health and Human Services. Retrieved on June 15, 2025 from https://library.samhsa.gov/sites/default/files/sma14-4884.pdf. 19. Substance Abuse and Mental Health Services Administration. (2023). Practical guide for implementing a trauma-informed approach (SAMHSA Publication No. PEP23-06-05-005). National Mental Health and Substance Use Policy Laboratory. Retrieved on June 15, 2025 from https://www.samhsa.gov/resource/ebp/practical-guide-implementing-trauma-informed-approach.  20. Bellis, M. A., Hardcastle, K., Ford, K., Hughes, K., Ashton, K., Quigg, Z., & Butler, N. (2017). Does continuous trusted adult support in chil\n\nactical-guide-implementing-trauma-informed-approach.  20. Bellis, M. A., Hardcastle, K., Ford, K., Hughes, K., Ashton, K., Quigg, Z., & Butler, N. (2017). Does continuous trusted adult support in childhood impart life-course resilience against adverse childhood experiences - a retrospective study on adult health-harming behaviours and mental well-being. BMC Psychiatry, 17(1), 110. https://doi.org/10.1186/s12888-017-1260-z.  21. Ashton, K., Davies, A. R., Hughes, K., Ford, K., Cotter-Roberts, A., & Bellis, M. A. (2021). Adult support during childhood: a retrospective study of trusted adult relationships, sources of personal adult support and their association with childhood resilience resources. BMC Psychology, 9(1), 101. https://doi.org/10.1186/s40359-021-00601-x.  22. Crouch, E., Radcliff, E., Strompolis, M., & Srivastav, A. (2018). Safe, Stable, and Nurtured: Protective Factors against Poor Physical and Mental Health Outcomes Following Exposure to Adverse Childhood Experiences (ACEs)\n\n, E., Strompolis, M., & Srivastav, A. (2018). Safe, Stable, and Nurtured: Protective Factors against Poor Physical and Mental Health Outcomes Following Exposure to Adverse Childhood Experiences (ACEs). Journal of Child & Adolescent Trauma, 12(2), 165–173. https://doi.org/10.1007/s40653-018-0217-9. 23. Goetschius, L. G., McLoyd, V. C., Hein, T. C., Mitchell, C., Hyde, L. W., & Monk, C. S. (2023). School connectedness as a protective factor against childhood exposure to violence and social deprivation: A longitudinal study of adaptive and maladaptive outcomes. Development and Psychopathology, 35(3), 1219–1234. https://doi.org/10.1017/S0954579421001140.  24. Bethell, C. D., Garner, A. S., Gombojav, N., Blackwell, C., Heller, L., & Mendelson, T. (2022). Social and Relational Health Risks and Common Mental Health Problems Among US Children:\n\nommon Mental Health Problems Among US Children:",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "trauma",
        "aces",
        "toxic stress",
        "resilience",
        "relationship",
        "student",
        "support",
        "mental health",
        "behavior"
      ]
    }
  ]
}