{
  "resources": [
    {
      "id": 1,
      "title": "California Healthy Kids Survey Resources",
      "title_es": "Recursos de la Encuesta de Niños Saludables de California",
      "description": "Free survey tools and resources to assess school climate, student wellness, and resilience factors. Includes data analysis support and evidence-based recommendations for school improvement.",
      "description_es": "Herramientas de encuesta gratuitas y recursos para evaluar el clima escolar, el bienestar estudiantil y los factores de resiliencia. Incluye apoyo de análisis de datos y recomendaciones basadas en evidencia para la mejora escolar.",
      "url": "https://calschls.org/",
      "category": "Practical Tools",
      "resourceType": "Assessment",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "survey",
        "assessment",
        "school climate",
        "California",
        "data"
      ],
      "location": "California"
    },
    {
      "id": 2,
      "title": "California School-Based Health Alliance",
      "title_es": "Alianza de Salud Escolar de California",
      "description": "Resources for school nurses, counselors, and health staff working with trauma-affected students. Includes referral protocols, mental health screening tools, and wellness program templates.",
      "description_es": "Recursos para enfermeras escolares, consejeros y personal de salud que trabajan con estudiantes afectados por traumas. Incluye protocolos de referencia, herramientas de detección de salud mental y plantillas de programas de bienestar.",
      "url": "https://www.schoolhealthcenters.org/",
      "category": "Practical Tools",
      "resourceType": "Tool",
      "gradeLevels": [
        "All Staff"
      ],
      "keywords": [
        "health",
        "counseling",
        "screening",
        "California",
        "wellness"
      ],
      "location": "California"
    },
    {
      "id": 3,
      "title": "CDC-Kaiser ACE Study - Original Research",
      "title_es": "Estudio ACE CDC-Kaiser - Investigación Original",
      "description": "Access the groundbreaking original ACEs study that established the link between childhood adversity and long-term health outcomes. Essential reading for understanding the evidence base behind trauma-informed practices.",
      "description_es": "Acceda al innovador estudio ACEs original que estableció el vínculo entre la adversidad infantil y los resultados de salud a largo plazo. Lectura esencial para comprender la base de evidencia detrás de las prácticas informadas sobre el trauma.",
      "url": "https://www.cdc.gov/violenceprevention/aces/index.html",
      "category": "Research & Evidence",
      "resourceType": "Article",
      "gradeLevels": [
        "All Staff"
      ],
      "keywords": [
        "research",
        "CDC",
        "ACEs study",
        "evidence",
        "health outcomes"
      ],
      "location": "National"
    },
    {
      "id": 4,
      "title": "California Department of Education - Social Emotional Learning",
      "title_es": "Departamento de Educación de California - Aprendizaje Socioemocional",
      "description": "CDE's official SEL resources aligned with trauma-informed practices. Includes curriculum frameworks, assessment tools, and integration strategies for elementary through high school.",
      "description_es": "Recursos oficiales de SEL del CDE alineados con prácticas informadas sobre el trauma. Incluye marcos curriculares, herramientas de evaluación y estrategias de integración desde primaria hasta secundaria.",
      "url": "https://www.cde.ca.gov/ci/se/",
      "category": "Official Resources",
      "resourceType": "Guide",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "SEL",
        "curriculum",
        "California",
        "CDE",
        "frameworks"
      ],
      "location": "California"
    },
    {
      "id": 5,
      "title": "California's Multi-Tiered System of Supports Framework",
      "title_es": "Marco de Sistema de Apoyo de Múltiples Niveles de California",
      "description": "Comprehensive MTSS framework integrating academic, behavioral, and social-emotional supports. Includes implementation guides, assessment tools, and professional learning modules for California educators.",
      "description_es": "Marco integral de MTSS que integra apoyos académicos, conductuales y socioemocionales. Incluye guías de implementación, herramientas de evaluación y módulos de aprendizaje profesional para educadores de California.",
      "url": "https://www.cde.ca.gov/ci/cr/ri/mtsscomprti2.asp",
      "category": "Official Resources",
      "resourceType": "Guide",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "MTSS",
        "tiered supports",
        "California",
        "CDE",
        "intervention"
      ],
      "location": "California"
    },
    {
      "id": 6,
      "title": "California Evidence-Based Clearinghouse for Child Welfare",
      "title_es": "Centro de Información Basado en Evidencia de California para Bienestar Infantil",
      "description": "Searchable database of evidence-based programs for supporting children affected by trauma and adversity. Rates program effectiveness and provides implementation guidance.",
      "description_es": "Base de datos consultable de programas basados en evidencia para apoyar a niños afectados por trauma y adversidad. Califica la efectividad del programa y proporciona orientación de implementación.",
      "url": "https://www.cebc4cw.org/",
      "category": "Research & Evidence",
      "resourceType": "Tool",
      "gradeLevels": [
        "All Staff"
      ],
      "keywords": [
        "evidence-based",
        "programs",
        "California",
        "child welfare",
        "database"
      ],
      "location": "California"
    },
    {
      "id": 7,
      "title": "Building Resilience in Adolescents - Research Summary",
      "title_es": "Construyendo Resiliencia en Adolescentes - Resumen de Investigación",
      "description": "Meta-analysis of protective factors and resilience-building interventions for middle and high school students. Includes practical applications of research findings for educators.",
      "description_es": "Metanálisis de factores protectores e intervenciones de construcción de resiliencia para estudiantes de escuela intermedia y secundaria. Incluye aplicaciones prácticas de hallazgos de investigación para educadores.",
      "url": "https://www.apa.org/topics/resilience",
      "category": "Research & Evidence",
      "resourceType": "Article",
      "gradeLevels": [
        "Middle School",
        "High School"
      ],
      "keywords": [
        "resilience",
        "adolescents",
        "research",
        "protective factors",
        "interventions"
      ],
      "location": "National"
    },
    {
      "id": 8,
      "title": "California School Counselors Association - Trauma Resources",
      "title_es": "Asociación de Consejeros Escolares de California - Recursos de Trauma",
      "description": "Professional resources specifically for school counselors, psychologists, and social workers. Includes crisis intervention protocols, counseling techniques, and supervision guidelines.",
      "description_es": "Recursos profesionales específicamente para consejeros escolares, psicólogos y trabajadores sociales. Incluye protocolos de intervención en crisis, técnicas de consejería y pautas de supervisión.",
      "url": "https://www.schoolcounselor-ca.org/",
      "category": "Official Resources",
      "resourceType": "Guide",
      "gradeLevels": [
        "All Staff"
      ],
      "keywords": [
        "counseling",
        "California",
        "CSCA",
        "mental health",
        "intervention"
      ],
      "location": "California"
    },
    {
      "id": 9,
      "title": "Family Engagement Strategies for Trauma-Affected Families",
      "title_es": "Estrategias de Participación Familiar para Familias Afectadas por Trauma",
      "description": "Culturally responsive strategies for engaging families experiencing trauma or adversity. Features communication templates, home visit protocols, and parent education resources.",
      "description_es": "Estrategias culturalmente receptivas para involucrar a familias que experimentan trauma o adversidad. Incluye plantillas de comunicación, protocolos de visitas domiciliarias y recursos de educación para padres.",
      "url": "https://www.naeyc.org/resources/topics/family-engagement",
      "category": "Practical Tools",
      "resourceType": "Guide",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "family engagement",
        "parents",
        "cultural responsiveness",
        "communication",
        "home visits"
      ],
      "location": "National"
    },
    {
      "id": 10,
      "title": "California's Expanded Learning Opportunities Program",
      "title_es": "Programa de Oportunidades de Aprendizaje Ampliado de California",
      "description": "State-funded afterschool and summer programs with trauma-informed frameworks. Includes program planning tools, staffing guidelines, and enrichment activity libraries.",
      "description_es": "Programas estatales después de la escuela y de verano con marcos informados sobre el trauma. Incluye herramientas de planificación de programas, pautas de personal y bibliotecas de actividades de enriquecimiento.",
      "url": "https://www.cde.ca.gov/ls/ex/",
      "category": "Official Resources",
      "resourceType": "Tool",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "afterschool",
        "California",
        "expanded learning",
        "summer programs",
        "CDE"
      ],
      "location": "California"
    },
    {
      "id": 11,
      "title": "Mindfulness and Trauma-Sensitive Yoga in Schools",
      "title_es": "Mindfulness y Yoga Sensible al Trauma en Escuelas",
      "description": "Evidence-based mindfulness and movement practices adapted for trauma-affected students. Features downloadable lesson plans, breathing exercises, and classroom yoga sequences for all ages.",
      "description_es": "Prácticas de mindfulness y movimiento basadas en evidencia adaptadas para estudiantes afectados por trauma. Incluye planes de lecciones descargables, ejercicios de respiración y secuencias de yoga en el aula para todas las edades.",
      "url": "https://traumasensitiveyoga.com/",
      "category": "Practical Tools",
      "resourceType": "Tool",
      "gradeLevels": [
        "K-12"
      ],
      "keywords": [
        "mindfulness",
        "yoga",
        "movement",
        "regulation",
        "practices"
      ],
      "location": "National"
    },
    {
      "id": 12,
      "title": "California Association of School Psychologists - ACEs Resources",
      "title_es": "Asociación de Psicólogos Escolares de California - Recursos ACEs",
      "description": "Professional development materials, assessment tools, and intervention frameworks for school psychologists working with trauma-affected students across California districts.",
      "description_es": "Materiales de desarrollo profesional, herramientas de evaluación y marcos de intervención para psicólogos escolares que trabajan con estudiantes afectados por trauma en distritos de California.",
      "url": "https://casponline.org/",
      "category": "Community Resources",
      "resourceType": "Network",
      "gradeLevels": [
        "All Staff"
      ],
      "keywords": [
        "school psychology",
        "California",
        "CASP",
        "assessment",
        "professional development"
      ],
      "location": "California"
    },
    {
      "id": 13,
      "title": "California School Dashboard - Student Wellbeing Metrics",
      "title_es": "Panel Escolar de California - Métricas de Bienestar Estudiantil",
      "description": "Access statewide data on suspension rates, chronic absenteeism, and other indicators of student wellbeing. Essential for tracking trauma-informed practice outcomes and identifying schools needing additional support.",
      "description_es": "Acceda a datos estatales sobre tasas de suspensión, ausentismo crónico y otros indicadores de bienestar estudiantil. Esencial para rastrear resultados de prácticas informadas sobre el trauma e identificar escuelas que necesitan apoyo adicional.",
      "url": "https://www.caschooldashboard.org/",
      "category": "Practical Tools",
      "resourceType": "Tool",
      "gradeLevels": [
        "All Staff"
      ],
      "keywords": [
        "data",
        "California",
        "dashboard",
        "metrics",
        "outcomes",
        "suspension rates"
      ],
      "location": "California"
    },
    {
      "id": 14,
      "title": "California Education Code - Student Mental Health Resources",
      "title_es": "Código de Educación de California - Recursos de Salud Mental Estudiantil",
      "description": "Complete legal framework for student mental health services in California schools. Includes mandated reporting requirements, confidentiality guidelines, and state funding opportunities for trauma-informed initiatives.",
      "description_es": "Marco legal completo para servicios de salud mental estudiantil en escuelas de California. Incluye requisitos de informes obligatorios, pautas de confidencialidad y oportunidades de financiación estatal para iniciativas informadas sobre el trauma.",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displayexpandedbranch.xhtml?tocCode=EDC",
      "category": "Official Resources",
      "resourceType": "Guide",
      "gradeLevels": [
        "All Staff"
      ],
      "keywords": [
        "education code",
        "legal",
        "California",
        "mental health",
        "mandates",
        "compliance"
      ],
      "location": "California"
    },
    {
      "id": 15,
      "title": "Sacramento County Office of Education - Early Childhood Trauma Resources",
      "title_es": "Oficina de Educación del Condado de Sacramento - Recursos de Trauma en la Primera Infancia",
      "description": "Specialized resources for addressing trauma in early childhood education settings (Pre-K through Grade 3). Features developmentally appropriate interventions, family partnership strategies, and transition planning for California educators.",
      "description_es": "Recursos especializados para abordar el trauma en entornos de educación de la primera infancia (Pre-K hasta 3er grado). Incluye intervenciones apropiadas para el desarrollo, estrategias de asociación familiar y planificación de transición para educadores de California.",
      "url": "https://www.scoe.net/",
      "category": "Trauma-Informed Education",
      "resourceType": "Guide",
      "gradeLevels": [
        "Elementary"
      ],
      "keywords": [
        "early childhood",
        "PreK",
        "California",
        "young children",
        "Sacramento",
        "developmental"
      ],
      "location": "California"
    }
  ]
}